{"url": "www.cs.fsu.edu/academics/graduate-programs/ms-thesis-checklist/", "text": "MS (thesis-option) Graduation Checklist | MS (thesis-option) Graduation Checklist Below is a brief checklist of items an MS (thesis option) student should complete before graduation: Degree Requirements Checklist At least 7 courses (21 hours) at or above the 5000 level excluding supervised teaching, supervised research, seminars, DIS, CIS 5915 Of the 7 courses, there must be at least one course from each of the core areas: Software, Systems, Theory At least 9 hours of CIS 5970, Thesis, where at most 9 hours count toward the required 30 hours for the degree In the final term in which the degree is granted, students must be enrolled in a minimum of two hours of Thesis Register, at most once, for CIS 8976, Thesis Defense (withdraw from all but one instance of this if you have registered more than once) Register for graduation via the Registrar’s website during the first two weeks of the semester in which you wish to graduate Defense & Graduation Checklist Determine the manuscript approval deadline, the manuscript submission deadline, and the defense deadline. These change each semester & are available on the Registrar’s web site under the FSU Academic Calendar as well as here Please see the Thesis, Treatise, and Dissertation for all deadlines, required forms, format guides, and other information and resources Schedule defense (at least 2 weeks in advance): Reserve room (typically 151 Love) Reserve PC cart (if needed) by signing up on calendar on the door in the copy room in 260 Love Complete the Defense Announcement Form (due no later than 2 weeks before the defense date) Inform title, room, and time of defense so that notification can be sent out Obtain the CS Defense Result Form (“green form”) from outside office 203A. Take this form with you to the defense to record the outcome of the defense. Have all the Graduate School required forms with you at the defense for signatures. These are all found here . Return the CS Defense Result Form to the CS Graduate Coordinator, Daniel Clawson. Bring all the Graduate School required forms (Final Degree Clearance Form, Manuscript Signature Form, etc.) to Daniel Clawson. Make sure they have ALL required signatures from your committee chair, committee, and department chair. He will forward the forms on to the dean’s office and/or graduate clearance advisor. Make sure your manuscript is submitted to the Graduate Clearance Advisor over in the Graduate School by the deadline listed here Submit an electronic version (pdf) of the project to the CS webmaster (webmaster [at cs dot fsu dot edu]) and the Graduate Coordinator (clawson [at cs dot fsu dot edu]). Complete the departmental EXIT survey (sent electronically towards the end of the semester). If your employment plans are uncertain when completing the EXIT survey, inform the CS Director of Graduate Studies via email when those plans are complete."}