{"url": "www.cs.fsu.edu/academics/undergraduate-programs/bscb-degree-requirements/", "text": "COMPUTATIONAL BIOLOGY DEGREE REQUIREMENTS | COMPUTATIONAL BIOLOGY DEGREE REQUIREMENTS College: Arts and Sciences Degree: B.S. Limited Access: No Contact: Computer Science: Kimberly Pack Address: C.S.: 203C Love Bldg.; Tallahassee, FL 32306-4530 Phone: C.S.: (850) 644-8700 Email: C.S.: advisor@cs.fsu.edu Note to prospective transfer students. Prospective transfer students should contact as-admissions@fsu.edu (Arts & Sciences Admissions) with specific questions about admission and mapping requirements. Description of Major Computational biology is a new and promising field of study. The purpose of this interdisciplinary major is to provide a top-notch educational program for students interested in the areas of computational biology and bioinformatics. The program seeks to achieve two goals: 1) to develop an understanding of the issues associated with developing biologically meaningful computational models, and 2) to give students the broad-based education that is needed to create a set of models directed towards solving a practical biomedical problem. This major is offered through the Computer Science departments. The Biological Science department has a separate Computational Biology degree with different degree requirements. Please see the Biological Science department for degree requirements. Prerequisite Coursework: BSC X010 (3,) General Biology I or equivalent BSC X011 (3) General Biology I or equivalent CHM X045, X045L (3, 1) General Chemistry I & Lab or equivalent CHM X046, X046L (3, 1) General Chemistry II & Lab PHY X053, X053L (4) or PHY X048, X048L (4) College or General Physics A with lab MAC X311 (4) Calculus I MAC X312 (4) Calculus II Interested students are encouraged to contact the participating departments regarding completion of these courses. Strongly recommended: Students interested in this major are encouraged to complete an introductory programming course in C++ or equivalent during their freshman/sophomore years. Note: State-wide common prerequisites are always under review. For the most current information and for acceptable alternative courses, visit the “Common Prerequisites Manual.” This is available from the “Student Services” section of http://www.flvc.org . Requirements for graduation in the College of Arts and Sciences include : The College of Arts and Science requires proficiency in a foreign language through the intermediate (2220 or equivalent) level or sign language through the advanced (2614 or equivalent) level. Requirements for Progression to the Upper-Division Major Students must complete at least 52 semester hours of credit with a minimum grade point average of 2.0, at least half the required Liberal Studies hours including English and mathematics, or an A.A. Degree. Mapping Mapping is FSU’s academic advising and monitoring system. Academic progress is monitored each Fall and Spring semester to ensure that students are on course to earn their degree in a timely fashion. Transfer students must meet mapping guidelines to be accepted into their majors. View the map for this major at www.academic-guide.fsu.edu/ . Major Program of Studies at FSU: 43 hours All courses applicable to the major must be completed with a grade of C- or better. Required Biological Science Courses (9 hours) BSC 2010 (3) Biological Science I BSC 2011 (3) Biological Science II PCB 3063 (3) Genetics Required Computer Science Courses (16 hours) COP 3014 (3) Programming I COP 3353 (1) Introduction to UNIX COP 3330 (3) Object-Oriented Programming CDA 3100 (3) Computer Organization I COP 4530 (3) Data Structures, Algorithms, and Genetic Programming COP 4531 or CIS 4930 Algorithms for CompBio. Additional Elective Courses (18 hours) Eighteen (18) hours of electives chosen from Biology, Computer Science, Math and/or Statistics. The Computer Science electives may be chosen from CDA 3101, COP 4531, COP 4710, COP 4420, and CIS 4900r. Biology electives are chosen from BOT 4394, BSC 2010L, BSC 2011L, BSC 4613, BSC 4900r, BSC 4933, MCB 4403, MCB 4403L, PCB 3134, PCB 3743, PCB 4024, PCB 4233, PCB 4253, PCB 4674, or PCB 4843. The math electives are chosen from MAC 2312, MAC 2313, MAP 2480, or MAP 4481. The Statistics electives are chosen from STA 4102, STA 4103, STA 4202, STA 4203, STA 4502, or STA 4702. Collateral Courses : 27-28 hours All collateral courses must be completed with a grade of C- or better. Mathematics/Statistics (14 hours) MAC 2311 (4) Calculus with Analytical Geometry I MAC 2312 (4) Calculus with Analytical Geometry II MAD 2104 (3) Discrete Mathematics STA 2171 (3) Statistics for Biology Physics, one of the following series (4 or 5 hours) PHY 2053C (4) College Physics A with Lab or PHY 2048C (5) General Physics A with Lab Chemistry (8 hours) CHM 1045 and 1045L (3,1) General Chemistry I and Lab CHM 1046 and 1046L (3,1) General Chemistry II and Lab Minor Requirements: The required collateral courses in mathematics constitute a minor; however, the student may select other minors in consultation with an advisor. Computer Skills Competency: 0 hours beyond major. COP 3014 (3). Oral Communication Competency: 0-3 hours Students must demonstrate the ability to orally transmit ideas and information clearly. This requirement may be met through appropriate high school speech training or with an approved college-level course. Minimum Program Requirements – Summary Total Hrs. Required 120 Liberal Studies *36 Prerequisite Coursework 0 beyond other requirements Major Coursework 43 Collateral Coursework 27-28 Minor Coursework 0 beyond collateral courses Foreign Language 0-12 (depending on placement) Computer Skills 0 beyond major Oral Communication Competency 0-3 Electives to bring total hours to 120 *Some coursework completed for this major may also apply toward Liberal Studies in the areas of Mathematics and Science. Remarks: 1. A minimum of 45 hours at the 3000 level or above, 30 of which must be taken at this University. 2. Half of the major course semester hours must be completed in residence at this University. 3. The final 30 hours must be completed in residence at this University. Employment Information Salary Information: National Association of Colleges and Employers , Occupational Outlook Handbook Representative Job Titles Related to this Major : Computational Biologist, Bioinformatics Specialist, Biotechnologist, Pharmaceutical/Medical Researcher, Forensic Scientist, Molecular Medicine Specialist, Comparative Genomics Scientist, Genetic Engineer, Human Geneticist, and Genome Analyst, Programmer, Systems Analyst, Software Engineer, Data Processing System Manager, Network Administrator. Representative Employers : Pharmaceutical Companies, Healthcare Providers, Medical Laboratories, Biotechnology Companies, Law Enforcement Agencies, Colleges and Universities, State and Federal Government, Software Development Companies. Updated: Summer 2015"}