{"url": "www.cs.fsu.edu/academics/tutorpolicy/", "text": "Policy on Tutors | Policy on Tutors This department discourages the use of tutors. Students who have problems in a course should first contact their instructor. A student who needs a modest amount of individual help should get it from the instructor and teaching assistants for the course. While we cannot prevent a student from hiring a tutor, we will not endorse or recommend anyone as a tutor, nor will we act as intermediary for students attempting to locate a tutor. This policy is based on the following considerations: We want to hear if students are having trouble in a course. If a student has the prerequisites for a course and is putting in the expected level of effort, and if the course is being taught well enough, there should be no need for a tutor. When students hire tutors instead of going to the instructor or department administration to solve their problems it can make it appear to the instructor and the department that everything is going well when in fact it is not. For example: if there is a need to spend more time teaching a particular topic, the instructor needs to find out; if the student is missing necessary background, it may be best for the student to switch to another course; if the instructor is not doing the job well, the department chair should hear about it. In short, if there is a serious problem we want to be informed of it and to solve it. This is the main reason for the policy. We cannot guarantee the competence of a tutor. An incompetent or misinformed tutor could do a student academic harm. Student problems are often very specific to material that is covered in class, or that is related to a programming assignment. Since tutors do not attend the class meetings, they will not be well informed. If a student hires a tutor and the tutor teaches the student something different from what the instructor is teaching, the student will suffer. We have seen cases of tutors helping students do programming assignments. This is a big temptation for the student and the tutor, since it is much quicker and easier to show a person how to solve a specific homework problem or programming assignment than it is to help the student learn the skills needed to solve the problem on his/her own. When this happens it is bad in two ways: It is a violation of the FSU Academic Honor Code . The student’s final grade suffers. Since the learning objectives of the assignment are not accomplished, the student will not have the knowledge and skills to pass the examinations. This can result in a student having even an “A” average on homework and failing the course. (It is common for courses to have a policy that examination grades must be at least passing in order for a student to pass a course, no matter how high the grades on unsupervised work.) Using a tutor in a college course is unfair to other students, in the sense that it gives students with extra money an advantage over students who might work as hard or harder but who have less money to spend. Note: The policy of discouraging the use of tutors does not apply to accommodations for disabilities that are approved by the Student Disability Resource Center . If such a student wants to find a tutor, there are usually some upper level undergraduate students and graduate students who are willing to serve as tutors. Notices soliciting and offering tutoring services show up on bulletin boards in the Love Building from time to time."}