{"url": "www.cs.fsu.edu/academics/undergraduate-programs/bscs-program-mission-educational-objectives-student-outcomes/", "text": "BS Degree Program Mission, Educational Objectives & Student Outcomes | BS Degree Program Mission, Educational Objectives & Student Outcomes The following information is applicable from Fall 2020. For previous information please check this link. The primary mission of the undergraduate program in Computer Science is to provide a high quality undergraduate educational program. To this end, the department seeks continually to strengthen the faculty and the education program to assure that students are well prepared for careers in the field of Computer Science. The Computer Science department’s Bachelor of Science in Computer Science degree program is accredited by the Computing Accreditation Commission of ABET, http://www.abet.org . ABET is the recognized accrediting body of college and university programs in engineering, computing, technology and applied science. Our BS CS program is characterized by Program Educational Objectives and Student Outcomes. The program educational objectives describe expected accomplishments of our graduates of the BS program and is consistent with the mission of the department. The student outcomes define the criteria that prepare students to attain the program objectives. The department periodically assesses and evaluates the BS curriculum for consistency with each student outcome and educational objective with the goal to ensure that each student outcome can be attained. This regular evaluation is used to identify program weaknesses, put improvements in place and re-evaluate the effectiveness of those improvements; resulting in continuous improvement of the program. This assures that our students receive a high-quality education. Departmental Mission Statement To strive for excellence in advancing, applying, and imparting knowledge in computer science through comprehensive educational programs, research in collaboration with industry and government, and dissemination through scholarly products; To produce outstanding computer science professionals who have the fundamental knowledge, problem-solving skills, and life-long learning capability to advance their careers; To disseminate computer science knowledge to students and professionals in other disciplines, and To provide service to the university community, professional societies, local communities, the state, and the nation. The program educational objectives for the Bachelors of Science degree program in Computer Science is to produce graduates who will: Goal 1: Problem solving and presentation Engage in the practice of computer science to identify and solve significant problems across a broad range of application areas, and communicate these solutions professionally. Goal 2: Theoretical foundations Apply sound principles of the theoretical foundations and mathematical bases of computer science in solving complex problems. Goal 3: Impact and Responsibility Embrace the breadth of impact of computing on society, and apply ethical, social and professional responsibilities in the profession. Goal 4: Life-long learning Adapt to new technologies, tools and methodologies to remain at the leading edge of computer science developments and practice in the profession and in the academic field. BS Degree Student Outcomes ABET/CAC Outcomes Note that SMALC/SACS outcomes are defined right after these outcomes. A1. Analyze a complex computing problem and to apply principles of computing and other relevant disciplines to identify solutions. SMALC/SACS outcome: SA A2. Design, implement, and evaluate a computing-based solution to meet a given set of computing requirements in the context of the program’s discipline. SMALC/SACS outcome: SB A3. Communicate effectively in a variety of professional contexts. SMALC/SACS outcomes: SC A4. Recognize professional responsibilities and make informed judgements in computing practice based on legal and ethical principles. SMALC/SACS outcome: SD A5. Function effectively as a member or leader of a team engaged in activities appropriate to the program’s discipline. SMALC/SACS outcome: SE A6. Apply computer science theory and software development fundamentals to produce computing-based solutions. SMALC/SACS outcomes: SF The acceptance and use of the program educational objectives and student outcomes of the BS degree program are periodically assessed by the CS faculty, by the CS Board of Advisors, and by the officers of the FSU ACM Student Chapter. SMALC/SACS FSU Institutional Effectiveness Outcomes The Florida State University is accredited by the Southern Association of Colleges and Schools (SACS). The accreditation standards require the use of the State Mandated Academic Learning Compacts (SMALC) to define the student outcomes. The SMALC/SACS outcomes SA to SF to attain the learning outcomes listed below: SA) Programming Competence: Upon completion of the program, the student will be able to analyze a complex computing problem and to apply principles of computing and other relevant disciplines to identify solutions. Assessment: A programming assignment in COP4530. SB) Software Analysis and Development: Upon completion of the program, the student will be able to design, implement, and evaluate a computing-based solution to meet a given set of computing requirements in the context of the program’s discipline. Assessment: capstone group project in CEN4090L. SC) Communication: Upon completion of the program, the student will be able to communicate effectively in a variety of professional contexts. Assessment: a writing assignment and a presentation assignment, both in CEN4020. SD) Ethics and Responsibility: Upon completion of the program, the student will be able to recognize professional responsibilities and make informed judgements in computing practice based on legal and ethical principles. Assessment: assignment or exam in CIS3250.. SE) Teamwork: Upon completion of the program, the student will be able to function effectively as a member or leader of a team engaged in activities appropriate to the program’s discipline. Assessment: capstone group project in CEN4090L. SF) Theory and Practice: Upon completion of the program, the student will be able to apply computer science theory and software development fundamentals to produce computing-based solutions. Assessment: an assignment in COT4420 and another assignment in COP4530. The SMALC/SACS outcomes for the BS degree are related to the ABET/CAC student outcomes as follows. SMALC/SACS FSU Institutional Effectiveness Outcomes ABET/CAC mapping SA. Programming Competence A1 SB. Software Analysis and Development A2 SC. Communication A3 SD. Ethics and Responsibility A4 SE. Teamwork A5 SF. Theory and Practice A6 Undergraduate Enrollment and Degrees Awarded Comprehensive and update-to-date data about enrollments and degrees awarded are available interactively at https://ir.fsu.edu/ (Select Student Information and then Interactive Enrollment Reports and Degrees Awarded). Our program is in the College of Arts and Sciences and the major is BS in Computer Science). Data can be broken down based on Colleges, Departments, Majors, and so on. Year Enrollment Degrees Awarded 2019 627 99 (Spring and Summer 2020 not included) 2018 610 176 2017 606 127 2016 619 100 2015 548 97"}