{"url": "www.cs.fsu.edu/academics/women-in-computer-science/", "text": "Women in Computer Science | Apply to be a Mentor Apply to be a Mentee Overview: Beginning in Spring 2018, the Computer Science department will be addressing the issue of low representation of women in Computer Science through a series of departmental initiatives. The primary initiative is the creation of Women in Computer Science (WiCS). This organization is a social and professional group geared at helping to advance women in the department and the field at large through a departmental mentorship program, creating a network to connect students to alumni, and hosting monthly guest speaker and student social events designed to help support and connect students. The Need: In Fall 2017, there were 24.9% undergraduate females and 75.1% undergraduate males enrolled in the Computer Science department at Florida State University, or about a 1:3 ratio of undergraduate females to males. While this number is low, it is higher than the national average 17.9% of women who graduated with a Computer Science bachelor’s degree in 2016 (Zweben and Bizot, 2016). While the Computer Science field is booming, the number and proportion of Computer Science degrees earned by women has decreased in the past 10 years (National Science Foundation, 2017). In the Computer Science department at Florida State University, we do not settle for higher than the national average, and we are making equal representation in Computer Science a priority in our department. The underrepresentation of women in Computer Science raises the possibility that the field functions in a way that may prevent or hinder women from becoming a part of it (Pearl et al., 2002). Thus, it is pivotal that departments and organizations evaluate their internal practices to ensure women are receiving the support they need to enter and advance in the field. Women in Computer Science (WiCS): All students are welcome to join WiCS, even if they would not like to be a mentor or mentee. Monthly socials and guest speaker sessions will occur the second Wednesday of every month. Please keep up-to-date with the latest WiCS news by following us on Social Media ( Facebook ). WiCS Student Council: The Student Council is a group of undergraduate and graduate students interested in leading WiCS. The Student Council creates the agenda for monthly socials and guest speakers and helps to make executive decisions for the group. The WiCS Student Council also monitors and controls the Social Media pages for WiCS. Mentorship: Rationale: Research suggests there are four primary, interrelated obstacles for women in Computer Science: difficulties with self-esteem (imposter syndrome), lack of mentoring and role models, gender discrimination, and difficulties balancing career and family responsibilities (Pearl et al., 2002). It is well documented that mentorship programs help students to excel in STEM fields like Computer Science (Dennehy & Dasgupta, 2017), and are used at many colleges and universities that have higher-than-average women in Computer Science, like Carnegie Mellon (Frieze and Blum, 2002). Process: Mentees are paired with their mentors by the mentorship coordinator. Mentors are expected to reach out to their mentees within the first two weeks of receiving their mentees’ contact, and are expected to meet with their mentees at least once a month outside of the monthly WiCS meeting. The goal of these meetings are to build a rapport and offer support and resources to the mentee. Who can be a mentor or mentee? Students interested in becoming a mentor must meet the following requirements: Be an undergraduate or graduate, main campus student in the Computer Science department Taking or passed COP 4530, Data Structures Have a 2.7 or higher GPA Be willing to devote the time to being a mentor (estimated ten hours a month for a semester) Students interested in becoming a mentee must be within their first two years of the program, and not have taken COP 4530, Data Structures. In other words, students may be freshmen/sophomores or transfer students in their first year. Mentorships last for one semester. After this, mentors and mentees may opt out of the program or offer to extend their mentorship. Students of any sex or gender identity are welcome to apply. How to Become a Mentor or Mentee: Download the application on the website and email it to the program coordinator at advisor@cs.fsu.edu by the deadline printed on the application. Mentors will also need to complete an interview. Selected Mentors will be notified within a week of the interview if selected. References: Pearl, A., Pollack, M.E., Riskin, E., Thomas, B., Wolf, E., & Wu, A. (2002.) Becoming a computer scientist. SIGCSE Bull. 34, 2 (June 2002), 135-143. DOI=http://dx.doi.org/10.1145/543812.543847 Frieze, C. & Blum, L. (2002). Building an effective computer science student organization: the Carnegie Mellon women@SCS action plan. SIGCSE Bull. 34, 2 (June 2002), 74-78. DOI: https://doi.org/10.1145/543812.543835 Dennehy, T.C. & Dasgupta, N. (2017). Female peer mentors early in college increase women’s positive academic experiences and retention in engineering. Proceedings of the National Academy of Sciences of the United States of America, 114 (23). Doi: 10.1073/pnas.1613117114 National Science Foundation, National Center for Science and Engineering Statistics. 2017. Women, Minorities, and Persons with Disabilities in Science and Engineering: 2017. Special Report NSF 17-310. Arlington, VA. Available at www.nsf.gov/statistics/wmpd/ . Zweben, S. and Bizot, B. (2017). Generation CS continues to produce record undergrad enrollment; graduate degree production rises at both master’s and doctoral levels. Computing Research News , 29 (5). Available at https://cra.org/crn/wp-content/uploads/sites/7/2017/05/2016-Taulbee-Survey.pdf Created Fall 2017, Kimberly Pack"}