{"url": "www.cs.fsu.edu/academics/undergraduate-programs/bscs-program-mission-educational-objectives-student-outcomes-previous/", "text": "BS Degree Program Mission, Educational Objectives & Student (Up to Summer 2019) | BS Degree Program Mission, Educational Objectives & Student (Up to Summer 2019) The primary mission of the undergraduate program in Computer Science is to provide a high quality undergraduate educational program. To this end, the department seeks continually to strengthen the faculty and the education program to assure that students are well prepared for careers in the field of Computer Science. The Computer Science department’s Bachelor of Science in Computer Science degree program is accredited by the Computing Accreditation Commission of ABET, http://www.abet.org .  ABET is the recognized accrediting body of college and university programs in engineering, computing, technology and applied science. Our BS CS program is characterized by Program Educational Objectives and Student Outcomes. The program educational objectives describe expected accomplishments of our graduates of the BS program and is consistent with the mission of the department. The student outcomes define the criteria that prepare students to attain the program objectives. The department periodically assesses and evaluates the BS curriculum for consistency with each student outcome and educational objective with the goal to ensure that each student outcome can be attained. This regular evaluation is used to identify program weaknesses, put improvements in place and re-evaluate the effectiveness of those improvements; resulting in continuous improvement of the program. This assures that our students receive a high-quality education. The program educational objectives for the Bachelors of Science degree program in Computer Science is to produce graduates who will: Goal 1: Problem solving and presentation; Engage in the practice of computer science to identify and solve significant problems across a broad range of application areas, and communicate these solutions professionally (SMALC/SACS outcomes A-D, I-K, ABET student outcomes a-d, f, i, k); Goal 2: Theoretical foundations; Apply sound principles of the theoretical foundations and mathematical bases of computer science in solving complex problems (SMALC/SACS outcomes E-G, ABET student outcomes a, i, j); Goal 3: Impact and Responsibility; Embrace the breadth of impact of computing on society, and apply ethical, social and professional responsibilities in the profession (SMACS/ SACS outcomes L,M, ABET student outcomes e, g); Goal 4: Life-long learning; Adapt to new technologies, tools and methodologies to remain at the leading edge of computer science developments and practice in the profession and in the academic field (SMACS/SACS outcomes A-N, ABET student outcomes a-k). BS Degree Student Outcomes ABET/CAC Outcomes An ability to apply knowledge of computing and mathematics appropriate to the discipline. An ability to analyze a problem, and identify and define the computing requirements appropriate to its solution. An ability to design, implement, and evaluate a computer-based system, process, component, or program to meet desired needs. An ability to function effectively on teams to accomplish a common goal. An understanding of professional, ethical, legal, security and social issues and responsibilities. An ability to communicate effectively with a range of audiences. An ability to analyze the local and global impact of computing on individuals, organizations, and society. Recognition of the need for and an ability to engage in continuing professional development. An ability to use current techniques, skills, and tools necessary for computing practice. An ability to apply mathematical foundations, algorithmic principles, and computer science theory in the modeling and design of computer-based systems in a way that demonstrates comprehension of the trade-offs involved in design choices. An ability to apply design and development principles in the construction of software systems of varying complexity. The acceptance and use of the program educational objectives and student outcomes of the BS degree program are periodically assessed by the CS faculty, by the CS Board of Advisors, and by the officers of the FSU ACM Student Chapter. SMALC/SACS FSU Institutional Effectiveness Outcomes The Florida State University is accredited by the Southern Association of Colleges and Schools (SACS). The accreditation standards require the use of the State Mandated Academic Learning Compacts (SMALC) to define the student outcomes. The SMALC/SACS outcomes for the BS degree are related to the ABET/CAC student outcomes as follows. SMALC/SACS FSU Institutional Effectiveness Outcomes ABET/CAC mapping A. Programming competence a, c, i, k B. Oral presentation f C. Data structure knowledge a, c, i D. Recursive algorithm use a, c, i E. Computational complexity a, j F. Database knowledge a, c, i, j G. Assembly language a, c, i H. Technical writing f I. Teamwork d J. Software requirements analysis b K. Software design c, k L. Ethics and responsibility e M. Impact analysis g N. Continuing professional development h Departmental Mission Statement To strive for excellence in advancing, applying, and imparting knowledge in computer science through comprehensive educational programs, research in collaboration with industry and government, and dissemination through scholarly products; To produce outstanding computer science professionals who have the fundamental knowledge, problem-solving skills, and life-long learning capability to advance their careers; To disseminate computer science knowledge to students and professionals in other disciplines, and To provide service to the university community, professional societies, local communities, the state, and the nation."}