{"url": "www.cs.fsu.edu/category/studentrecog/page/2/", "text": "Student Recognition | CS Students won the best paper award in EuroS&P 2019 Student Recognition FSU CS students, Mustakimur R. Khandaker, Abu Naser, and Wenqing Liu, won the best paper award in EuroS&P 2019 (4th IEEE European Symposium on Security and Privacy), hold Jun 17 -19 at Stockholm Sweden, for their paper titled “Adaptive Call-site Sensitive Control Flow Integrity”. EuroS&P is the flagship security conference in Europe. CS students receive DoD Cyber Scholarships Student Recognition 2 juniors (major: Computer Science) and one graduate in Computer Science at FSU have been awarded DoD Cyber Scholarship. CS Students to Present in Top Computer Security Conference Student Recognition Mustakimur R. Khandaker, a Ph.D. student from the CS Department, has published a full paper in the prestigious 28th USENIX Security Symposium, which will hold on August 14-16, 2019 in Santa Clara, California. USENIX Security is one of the top-tier conferences in the Computer Security area. The paper, titled “Origin-sensitive Control Flow Integrity” proposes a new context-sensitive CFI system that can significantly improve the security of the state-of-art CFI systems. This work is the continuation of his earlier work published in EuroS&P’19 titled “Adaptive Call-site Sensitive Control Flow Integrity”. Both projects have been open-sourced available at the author’s GitHub page: https://github.com/mustakcsecuet/. The other students that contributed to the projects include Wenqing Liu and Abu... Recent Student Publications in CS Student Recognition Some of the recent student publications produced by members of the FSU Computer Science program… CS Student Presented in Top High Performance Computing Conference Student Recognition Peyman Faizian, a PhD student from the CS Department, has published a full paper in the prestigious IEEE/ACM SC: the International Conference for High Performance Computing, Networking, Storage and Analysis, held in November 2017 in Denver, Colorado. Ms. Gokila Dorai Awarded UPE Scholarship Student Recognition Ms. Gokila Dorai was awarded the UPE Scholarship Cash Award of $1000 by Upsilon Pi Epsilon « Older Entries Next Entries »"}