{"url": "www.cs.fsu.edu/category/news/page/5/", "text": "News | CS faculty part of an FSU research team that won award from National Institute on Aging News Prof. Shayok Chakraborty is part of an FSU research team that won a $2.9 million award from National Institute on Aging. Welcoming Chris Mills to our CS Faculty News The FSU Computer Science Department would like to extend a warm welcome to Chris Mills — Chris will be joining our teaching faculty and we are pleased he is doing so. Welcome, Chris! Chris Mills is now currently a Teaching Faculty member in the FSU Computer Science Department and Chief Research Officer of i2x Solutions, LLC. Chris earned his Ph.D. in Computer Science from FSU in Spring 2019. His doctoral research focused on software engineering, with a specific focus on applications of machine learning to software traceability. Chris has published and presented his work in/at ACM Transactions on Software Engineering and Methodology (TOSEM), The International Conference on Software Engineering (ICSE), The International Conference on Software Maintenance and Evolution (ICSME), and The Joint Meeting of the European Software Engineering Conference and the ACM SIGSOFT Symposium on the Foundations of Software Engineering (ESEC/FSE’17). At ICSME 2018, Chris’s paper “Are Bug Reports Enough for Text Retrieval-based Bug Localization?” was selected for an ACM Distinguished Paper award. Chris’ professional experience includes working as a technical consultant for 2 years and a software engineer for 5 years at Aderant. He also worked as a technical team lead for the Florida Department of Education before moving into his current role as CRO at i2x Solutions. As CRO, Chris is responsible for managing a diverse set of research projects centered around building next generation products using artificial intelligence to support complex business processes. For FSU, Chris looks forward to teaching courses on C#, Artificial Intelligence, and Software Engineering. Before entering Computer Science, Chris earned a M.S. in Applied and Computational Mathematics from FSU in 2011 and... FSU CS Faculty Welcomes back Ann Tyson to the Department News Ann F. Tyson joins the CS Faculty Many CS Students, Faculty, Staff, Recognized at Honors Day 2019 News The Computer Science Department held its annual Honors day on 4/19/19. Many students, faculty and staff in the department were recognized for Awards, Fellowships, Scholarships, or Society induction. CS awarded a significant amount of technology fee to upgrade its instructional technology infrastructure News The Computer Science Department has been awarded over $85K Technology Fee to upgrade its instructional technology infrastructure in four projects: (1) to upgrade Grads Lab computers, (2) to build CS private cloud services, (3) to upgrade the data center server switch, (4) to upgrade audio–visual technology in classrooms. The Systems Group manager, Yu Wang, and Systems Group member, Bobby Roy, developed the proposals for the four projects. The proposals were selected by the Student Technology Fee Advisory Committee, and approved by the IT Governance Council. Faculty promotion News Congratulations to Prof. Zhenghao Zhang for being promoted to the rank of full professor and to Prof. Sonia Haiduc and Prof. Jie Yang for being promoted to the rank of associate professor with tenure, all effective in Fall 2019. « Older Entries Next Entries »"}