{"url": "www.cs.fsu.edu/computer-science-welcomes-two-new-faculty-members/", "text": "Computer Science Welcomes Two New Faculty Members | Computer Science Welcomes Two New Faculty Members Dr. Viet Tung Hoang joins the department this fall semester as an assistant professor. He received his Ph.D. degree in Computer Science from UC Davis in 2013. Prior to joining FSU, Dr. Hoang held post-doc positions at UC San Diego, University of Maryland, and UC Santa Barbara. Dr.  Hoang’s research area is cryptography, with a practice-oriented theme. His line of research aims to bridge the gap between the theory and practice of cryptography, giving products of genuine utility that are theoretically justified yet faster than heuristic solutions. For example, he has built a new authenticated encryption scheme AEZ to improve both security and speed of standardized schemes underlying Internet protocols such as HTTPS, IPSec, and WPA2. AEZ is currently a second-round candidate in the standardization competition CAESAR. Dr. Hoang’s research papers earned the Best Honorable Mention at EUROCRYPT 2015 and Best Paper Award at CCS 2015. Dr. Adrian Nistor joins the department this fall semester as an assistant professor. Dr. Nistor received his PhD from the Department of Computer Science at the University of Illinois, Urbana-Champaign in May 2014. Prior to joining FSU, Dr. Nistor has been with the Computer Science Department at Chapman University as an assistant professor. Adrian’s research interests are in software engineering, with a focus on detecting, repairing, and preventing bugs in real-world applications. His current research projects investigate performance, concurrency, and mobile bugs. His techniques found more than 190 previously unknown bugs in widely used software, e.g., Google Chrome, Mozilla, Google Core Libraries, GCC, MySQL, Ant, Lucene, Groovy, Tomcat, JUnit, JMeter, Log4J, Struts, etc. More than 140 of these bugs have already been fixed by developers based on Adrian’s and his collaborators’ reports. Adrian’s research includes empirical and analytical work, static and dynamic techniques, and bugs from various application types—client, server, mobile, and scientific applications. Dr. Nistor won an ACM SIGSOFT Distinguished Paper award at ICSE 2015. He received an NSF grant as a sole PI to investigate performance bugs that have non-intrusive fixes. He is a committer to Apache Collections. He published in ICSE, MICRO, ISSTA, MSR, and JDPC. Adrian collaborated with three PhD students, three master’s students, and seven undergraduate students. He is looking for highly motivated students to do research with at Florida State University!"}