{"url": "www.cs.fsu.edu/department/chairsgreeting/", "text": "Chair’s Greeting | The Chair’s Greeting Welcome to the Department of Computer Science at the Florida State University. Our mission is: To strive for excellence in advancing, applying, and imparting knowledge in computer science through comprehensive educational programs, research in collaboration with industry and government, and dissemination through scholarly products; To produce outstanding computer science professionals who have the fundamental knowledge, problem-solving skills, and life-long learning capability to advance their careers. To disseminate computer science knowledge to students and professionals in other disciplines, and To provide service to the university community, professional societies, local communities, the state, and the nation. The department offers Bachelor programs in Computer Science, three Master of Science tracks, and Doctoral degrees in Computer Science. Currently we have over 600 majors in the BS/BA programs and about 160 graduate students working towards their degrees. Our BS in CS degree program is accredited by the national ABET Computing Accreditation Commission (CAC). In addition, we offer interdisciplinary bachelor’s degrees in Cyber Criminology and in Computational Biology, in collaboration with the College of Criminology and Criminal Justice and the department of Biology, respectively. The department offers cyber security and information assurance courses and was the first department in the state to receive the designation “NSA/DHS Center of Academic Excellence in Information Assurance education (CAEIAE) and Research (CAR-R)” for FSU. We are proud to be home to five NSF CAREER Award winners, a US Dept. of Energy Early Career Principal Investigator Award winner, an AFOSR Young Investigator Award winner, three Fulbright Scholar Award winners, an IEEE Fellow, ACM Distinguished Scientists, and a FSU Distinguished Research Professor. Our faculty are among the world’s leaders in Algorithms, Architecture, Databases, Distributed Systems, High-Performance Computing, Networking, Programming Languages and Compilers, Scientific Computing, Security, Software Engineering, and Vision. I encourage you to visit and explore our department to see our cutting edge research and educational programs. Xiuwen Liu Professor and Chair Department of Computer Science Florida State University"}