{"url": "www.cs.fsu.edu/financial-aid/other-national-fellowships-scholarships/", "text": "Other National Fellowships & Scholarships | Other National Fellowships & Scholarships The following list is a mixed list of opportunities for graduate and undergraduate students: AFCEA Educational Foundation Undergraduate and Graduate Scholarships Eligibility: Undergraduate, graduate students. AT&T Labs Fellowship Program Eligibility: Minority and women students who are U.S. Citizens or permanent residents and who are pursuing Ph.D. studies in computer and communications-related fields. DOE Computer Science Graduate Fellowships Eligibility: U.S. citizens or permanent resident aliens. DOE High Performance Computer Science Fellowship Program Eligibility: Graduate students. DOE Office of Science Graduate Fellowship Program Eligibility: Undergraduate senior students or first-year or second-year graduate students. Fannie and John Hertz Foundation Fellowship Eligibility: PhD students (can apply as seniors), US citizens or permanent residents. Ford Foundation Diversity Fellowships Eligibility: Predoctoral level, dissertation level, postdoctoral level. Gates Millennium Scholars Eligibility: Undergraduates (apply as high school seniors); US citizens or permanent residents; underrepresented minority; GPA of 3.3 on a 4.0 scale; demonstrated financial need. Gilman International Scholarship Eligibility: undergraduate student applicant provides proof that he/she will be receiving a Federal Pell Grant and is applying to or has been accepted into a study abroad program eligible for credit by his/her accredited institution. Hertz Foundation Eligibility: Graduate students. Hispanic Scholarship Fund Eligibility: Undergraduates (high school seniors can apply), graduate students. IBM PhD Fellowship Program Eligibility: PhD students; must be nominated by faculty member. Jack Kent Cooke Foundation Scholarship Eligibility: Undergraduates, graduate students. Microsoft Scholarships Eligibility: Undergraduates. NAE Fellowships Eligibility: Graduate students. NSF East Asia and Pacific Summer Institute for Engineering Graduate Students Eligibility: U.S. citizen or permanent resident. NSF Graduate Research Fellowship Program (GRFP) Eligibility: Undergraduates, graduate students. National Defense Science and Engineering Graduate Fellowship Eligibility: Fellowships are awarded to applicants who will pursue a doctoral degree. National Gem Consortium Fellowship Eligibility: Under-represented graduate students. National Physical Science Consortium Eligibility: Graduate students. National Science and Defense Engineering Graduate Fellowship Program (NDSEG) Eligibility: Graduate students (can apply as seniors). US citizenship required. National Society of Professional Engineers Eligibility: Undergraduate (can apply as high school senior) and graduate students. Sandia National Laboratories Truman Fellowship Eligibility: Undergraduate, graduate students. SME Education Foundation The SME Foundation awards scholarships and fellowships pursuing degrees in manufacturing and related fields. Eligibility: Undergraduate (can apply as high school senior) and graduate students. SWE Scholarship Program The SWE Scholarship Program provides financial assistance to those who identify as a female/woman and are studying community college, baccalaureate, or graduate programs in preparation for careers in engineering, engineering technology and computer science. Eligibility: Female students. Texas Space Grant Consortium (TSGC) Undergraduate Scholarships Eligibility: US Citizens, undergraduates. U.S. Department of Homeland Security Undergraduate Scholarships and Graduate Fellowships Eligibility: Undergraduate, graduate students. National Academies Research Associateship Programs Eligibility: Graduate students. Philanthropic Educational Organization funding for Women Eligibility: Female students. The Google Anita Borg Memorial Scholarship Eligibility: Female students."}