{"url": "www.cs.fsu.edu/financial-aid/sample-college-and-university-fellowships/", "text": "Sample College and University Fellowships | Sample College and University Fellowships For more information (including stipulations) see: http://www.gradstudies.fsu.edu/Funding-Awards University Fellowships Offered to graduate students based mainly on undergradate GPA and GRE scores. Effective for Fall/Spring academic year. Includes a tuition waiver and a health insurance supplement. Applications are due each year in January for the following academic year. Presidential Fellowships Offered to graduate students who are newly admitted to the Ph.D. program. Stipend is for the first and fourth years. Includes a tuition waiver and a health insurance supplement. Support for the second and third years are funded by the department that is at a level consistent with other students who have received departmental support. Applications are due each year in January for the following academic year. College Teaching Fellowships Offered to a select set of graduate students who applied for a university or presidential fellowship and did not receive one. A supplement to this stipend is provided by the department. A subsidy for health insurance is also provided. Leslie N. Wilson – Delores Auzenne Assistantship Offered to minority graduate students. Includes a tuition waiver and a subsidy for health insurance. McKnight Doctoral Fellowship These fellowships provide up to five years of support. $12,000 stipend is provided for the first four years. Additional support during each of these years is possible through the department. Tuition waivers and a subsidy for health insurance is also provided. A fifth year of support is also possible through the department that is at a level consistent with other students who have received departmental support. Deadline is January 15 for the following academic year. Applications are available on the FEF website . For more information regarding FSU application procedures, contact the Graduate School, 408 Westcott, Florida State University, Tallahassee, FL 32306-1047, (850) 644-3501."}