{"url": "www.cs.fsu.edu/fsu-professor-weikuan-yu-receives-a-research-grant-from-lawrence-livermore-national-lab/", "text": "FSU Professor Weikuan Yu Receives a Research Grant from Lawrence Livermore National Lab | FSU Professor Weikuan Yu Receives a Research Grant from Lawrence Livermore National Lab Dr. Weikuan Yu, from the Department of Computer Science at Florida State University, was awarded a grant of $72K from Lawrence Livermore National Laboratory for his most recent project on data-intensive systems research. Yu’s project, titled “A Distributed File System for Burst Buffers on HPC Systems” will conduct research and development activities to develop a distributed file system for burst buffers. Burst buffers are being introduced into high performance computing (HPC) storage architectures as a mechanism for solving the scalability problems associated with I/O from large-scale runs. By enabling the efficient use of burst buffers, this new project will address the needs of scalable performance and reliability across distributed burst buffers for data-intensive applications on leadership computing facilities. The resulting prototype will be incorporated to large-scale file systems at DOE computing facilities hosted at LLNL. Dr. Yu is a tenured Associate Professor in the Department of Computer Science at Florida State University (FSU). He served as a Research Staff Member at Oak Ridge National Lab until 2009, and then an assistant and associate professor at Auburn University until 2015. He is also credited as the creator of the Parallel Architecture and Systems Laboratory (PASL) at Auburn and FSU. Dr. Yu’s research interests include a multitude of technical areas including; data mining and analytics of big data and social networks, parallel computer systems and architecture, high speed interconnects, cloud computing, computational biology and climate modeling, and I/O systems. Once again, congratulations to Dr. Yu on his recent accomplishments. The development of more efficient distribution of burst buffers will do wonders in the field of large-scale file systems."}