{"url": "www.cs.fsu.edu/graduate-faq/", "text": "Graduate FAQ | Graduate FAQ APPLICATION QUESTIONS 1. Are paper recommendation letters accepted? No. All recommendation letters must be submitted online through the application system. Information on completing the online recommendation forms will be sent directly to those listed by the applicant. 2. Are photocopies or faxes of transcripts accepted? No. An official transcript from each institution attended by the applicant must be sent directly to the Florida State University Admissions Office. That address is: Office of Graduate Admissions Florida State University 314 Westcott Bldg. Tallahassee, FL. 32306-1410 USAPhone: (850) 644-3501 FSU Graduate Admissions e-mail: graduateadmissions@admin.fsu.edu URL: http://admissions.fsu.edu/ 3. My TOEFL and/or GRE score(s) is/are below the department standards. Will I be automatically denied? Should I apply? All complete applications are submitted to the Admissions Committee for review. If you do not meet the department standard, it is less likely that you will be recommended for admission, particularly if you fall below the university requirement of an overall score of 80 (IB-TOEFL) and 145 Verbal & 150 Quantitative on the GRE. 4. I took the GRE more than once. Which score do you accept: the highest or the most recent score? FSU will take the highest combined scores from all attempts of the GRE which we call the “Super Score”. For example if you got 142 verbal and 160 quantitative on your first  attempt and 146 verbal and 157 quantitative on your second attempt, the Super Score would be 146 verbal and 160 quantitative. 5. How long should my statement of purpose be? Statements of purpose are usually between one and three pages in length. 6. What should I include in my statement of purpose? A statement of purpose should provide details that cannot be obtained from the transcript or résumé.  You should state the interests and reason(s) for wanting to attend Florida State  University.  You should also provide an idea of possible research areas that you may want to pursue while in our graduate program and what experience you’ve had in these areas so far. Resume/Curriculum Vitae 1. What should this document contain? List any academic honor List any computer related course work and/or experience and all the programming languages that you know. List any teaching experience For international students, please describe your training and experience with English GRE QUESTIONS 1. Is the GRE required for admission to the University? Can it be waived? The University requires test scores from a nationally standardized graduate admission test. The Department requires the General GRE test. This requirement cannot be waived. 2. Can I send you a certified copy of my GRE score so you can make a decision and I will follow up with an “Official” score later? We can only accept official test scores for the purpose of evaluating your application. A GRE score is considered official when it is sent directly from the testing center to the university Office of Admissions. No other method is acceptable. This requirement cannot be waived. 3. Do you count the Analytical portion of the test? Some of our faculties do look at all the scores but the total GRE score is based only upon the Verbal and Quantitative portion. The minimum scores are 145 verbal and 150 quantitative. 4. If I score less than the posted minimums, can I be accepted? A minimum score does not assure a candidate of acceptance. Most of our admitted students are well above the posted minimums, but applications are reviewed for a sense of overall preparedness to potentially be successful in our graduate programs.  GRE scores are not the only factor that play into determining whether a student will be admitted, but they are a useful tool to help provide a basis of comparison between students that are coming from a variety of different colleges and university from many cultures and countries around the world. 5. Do you require the Computer Science Specific GRE test? No. 6. I have not taken the GRE test yet. Can I still go ahead and apply? Yes you can. However, your application will not be reviewed until complete. 7. The undergraduate GPA requirement for the graduate school is 3.0. If I score very good on the GRE would that offset a poor GPA? Not really. Your entire folder is evaluated by our Admission and Financial Aid Committee. A strong showing in one area does not necessarily offset a weak showing in another. TOEFL (Test Of English as a Foreign Language) QUESTIONS 1. I did not score high on the TOEFL test, can I still be admitted? The minimum score required by the University on the TOEFL test is 550 for the paper-based and 80 for internet-based. Falling below the minimums is an automatic denial without exception. The Department standards are significantly higher than the University requirements. 2. What is the average TOEFL test score? The average test is over 610 for the paper based and over 95 for the internet-based version. We have found that students who score below 600 paper-based or 95 internet-based on the TOEFL test do not typically do well in our courses because of the lack of communication ability. 3. My English is very good and I have lived in the United States since I was young. Do I need the TOEFL? If you are permanent resident, no. However, if you require a visa in order to stay in the country and you have not obtained a bachelor’s degree from the United States or another English speaking country, you need the TOEFL. GRADUATE ASSISTANTSHIP QUESTIONS 1. I’m interested in an assistantship through the department. What additional forms do I need to fill out? All Computer Science graduate applicants will be considered for an assistantship through the department, unless otherwise sponsored by a third party (e.g. Military, Government of Origin). For international students required to take the TOEFL exam, a score of 620 (Paper-Based) or 100 (Internet-Based) or 250 (Computer-Based) is necessary to be considered for an assistantship through the department. 2. What is the criteria for getting a Teaching Assistantship? This is a very difficult question. The Department uses Teaching Assistantships in various ways. (1) To attract highly qualified PhD students to our Department. They are given teaching assistantships in the assumption that they will eventually become research assistants. (2) To attract masters students with exceptional teaching ability to support the large number of lower level classes in computer science and computer literacy. Basically we look at all of the following criteria: Quality and ranking of the schools attended GPA GRE Scores TOEFL Scores (if applicable) Teaching experience Previous degree program Quality of research or research potential Quality of letters of recommendation An overall assessment of whether the student is serious about the degree program 3. I understand that if you apply to the PhD program, you stand a better chance of getting an assistantship. Is this true? No. Students should apply for the degree program that they intend to complete. TAs must have exceptional public speaking abilities and a solid academic background. Many of these students are MS degree-seeking students."}