{"url": "www.cs.fsu.edu/news/student-highlights/", "text": "Student Achievements | STUDENT ACTIVITIES & ACHIEVEMENTS Ph.D. CS Student Esteban Parra Rodriguez Receives Best Paper Award Jun 16, 2021 Ph.D. CS Student Esteban Parra Rodriguez Receives Best Paper Award… read more Wendy Slattery (FSU Online CS Student) Won Best Overall at the FSU PC Student Research Symposium Jun 16, 2021 Wendy Slattery (FSU Online CS Student) Won Best Overall at the FSU PC Student Research Symposium.. read more PhD Grad Linghan Zhang Lands Tenure-Track Position at George Mason University Apr 19, 2021 Linghan Zhang, a Ph.D. candidate under the supervision of Prof. Jie Yang, has earned a tenure-track Assistant Professor position in the Department of Cybersecurity at George Mason University. Her research focuses on cybersecurity including discovering new human biometrics, inventing biometric sensing methods, and… read more Ph.D. Graduate Hired for Tenure-Track Position at UGA Jun 07, 2020 Mustakimur R. Khandaker, a recent Ph.D. graduate advised by Dr. Zhi Wang, will join the Department of Computer Science at the University of Georgia as a Tenure-track Assistant Professor. Mustakimur’s research focuses on system and software security, more specifically, Control Flow Integrity (CFI)…. read more FSU Computer Science Ph.D. Student to Present in Top Computer Architecture & Systems Conference Feb 04, 2020 Mustakimur R. Khandaker, a Ph.D. candidate in the CS Department under the supervision of Prof. Zhi Wang, has published a full paper in the prestigious 25th ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS’20), which will hold on March 16-20, 2020 in Lausanne, Switzerland. read more FSU Students including CS undergraduate win Gold Dec 10, 2019 FSU undergraduate students including FSU Computer Science major Cameron Conroy competed and won gold at the international iGEM competition in Boston. read more CS Students won the best paper award in EuroS&P 2019 Jun 19, 2019 FSU CS students, Mustakimur R. Khandaker, Abu Naser, and Wenqing Liu, won the best paper award in EuroS&P 2019 (4th IEEE European Symposium on Security and Privacy), hold Jun 17 -19 at Stockholm Sweden, for their paper titled “Adaptive Call-site Sensitive Control Flow Integrity”. EuroS&P is the flagship security conference in Europe. read more CS students receive DoD Cyber Scholarships Jun 07, 2019 2 juniors (major: Computer Science) and one graduate in Computer Science at FSU have been awarded DoD Cyber Scholarship. read more CS Students to Present in Top Computer Security Conference May 30, 2019 Mustakimur R. Khandaker, a Ph.D. student from the CS Department, has published a full paper in the prestigious 28th USENIX Security Symposium, which will hold on August 14-16, 2019 in Santa Clara, California. USENIX Security is one of the top-tier conferences in the Computer Security area. The paper, titled “Origin-sensitive Control Flow Integrity” proposes a new context-sensitive CFI system that can significantly improve the security of the state-of-art CFI systems. This work is the continuation of his earlier work published in EuroS&P’19 titled “Adaptive Call-site Sensitive Control Flow Integrity”. Both projects have been open-sourced available at the author’s GitHub page: https://github.com/mustakcsecuet/. The other students that contributed to the projects include Wenqing Liu and Abu... read more Recent Student Publications in CS Apr 23, 2019 Some of the recent student publications produced by members of the FSU Computer Science program… read more « Older Entries"}