{"url": "www.cs.fsu.edu/news/student-highlights/page/2/", "text": "Student Achievements | STUDENT ACTIVITIES & ACHIEVEMENTS CS Student Presented in Top High Performance Computing Conference Nov 22, 2017 Peyman Faizian, a PhD student from the CS Department, has published a full paper in the prestigious IEEE/ACM SC: the International Conference for High Performance Computing, Networking, Storage and Analysis, held in November 2017 in Denver, Colorado. read more Ms. Gokila Dorai Awarded UPE Scholarship Oct 19, 2017 Ms. Gokila Dorai was awarded the UPE Scholarship Cash Award of $1000 by Upsilon Pi Epsilon read more Students Chosen to Attend Grade Hopper Conference Oct 19, 2017 Florida State Computer Science students Ms. Gokila Dorai, Ms. Rebecca James, Ms. Jordan Snow, and Ms. Soheila Abishrami were chosen to attend the GraceHopper read more Two papers from the CS department accepted by ACM CCS, one of the top security conferences Aug 30, 2017 Two papers from the CS department have been accepted by this year’s ACM Conference on Computer and Communications Security (CCS), one of the top security conferences. read more CS Student Presented in Top Security Conference Aug 23, 2017 Yue Chen, a fourth-year PhD student, has been conducting research in system and mobile security under the guidance of Prof. Zhi Wang. His recent paper titled “Adaptive Android Kernel Live Patching” has been published in USENIX Security 2017, a top-tier conference in security and privacy. read more CS student won FSU Preparing Future Faculty award May 12, 2017 Ms. Gokila Dorai, a PhD student supervised by Prof. Sudhir Aggarwal, is among the winners of the 2017 FSU Preparing Future Faculty awards. read more CS Student Presented in Top Supercomputing Conference. Nov 23, 2016 Jason Lee, a Master student from the CS\tDepartment, has published a full paper in the prestigious\tIEEE/ACM SC: the International Conference for High Performance Computing, Networking, Storage and Analysis, held in November 2016 in Salt Lake City, Utah. read more CS Student Presented in Top Data Science Conference Oct 21, 2016 Masters Student Presents at Top Tier Conference read more CS doctoral student Teng Wang publishes in the 2016 Supercomputing Conference Oct 20, 2016 Doctoral Student Publishes in Prestigious Conference read more CS Student Published in Top Mobile and Wireless Computing Conference Sep 13, 2016 CS Student Published in Top Mobile and Wireless Computing Conference read more « Older Entries Next Entries »"}