{"url": "www.cs.fsu.edu/news/department-news/page/5/", "text": "Department News | NEWS & ANNOUNCEMENTS Dr. Hoang Awarded $174k Grant From NSF Jun 12, 2018 FSU Computer Science Prof. Viet Tung Hoang recently received a grant from the National Science Foundation (NSF) in the amount of $174,469, for his project “CRII: SaTC: Towards Stronger and Verified Security for Real-World Cryptography”. read more FSU Computer Science Welcomes Dr. Xifeng Gao May 18, 2018 Dr. Xifeng Gao will join the Department of Computer Science at FSU in Fall 2018 as an Assistant Professor. read more Dr. Zhao Awarded $450k Research Grant by Air Force May 18, 2018 Prof. Peixiang Zhao has been awarded a $450,000, three-year grant from the U.S. Air Force Office of Scientific Research (AFOSR)’s Young Investigator Research Program (YIP). read more Melina Myers promoted May 17, 2018 Congratulations to Melina Myers on her promotion to the rank of Teaching Faculty II. read more Dr. Zhi Wang and Dr. Peixiang Zhao promoted May 17, 2018 Congratulations to Dr. Zhi Wang and Dr. Peixiang Zhao on their promotion to the rank of associate professor with tenure. read more CS awarded a significant amount of technology fee to upgrade its instructional technology infrastructure May 17, 2018 The Computer Science Department has been awarded $100K Technology Fee to upgrade its instructional technology infrastructure read more Intel Awards Grant to FSU CS in Computer Vision Mar 5, 2018 Intel Corporation recently awarded a 6-months grant in the amount of $25,074 to Prof. Shayok Chakraborty. The objective of this project, titled “Active Learning for Computer Vision”, is to develop a semester-long curriculum on the emerging topic of active learning for computer vision applications. read more FSU Cybersecurity Club Ranks Among the Top in Recent Competitions Nov 17, 2017 Over the month of October, students from the Florida State University Cybersecurity Club traveled to three on-site competitions where they ranked among the top competitors. read more CS Professors Awarded a Grant to Secure High-performance Computing Aug 23, 2017 National Science Foundation (NSF) recently awarded a 3-year grant in the amount of $590,317 to Prof. Zhi Wang, Prof. Xin Yuan, Prof. Viet Tung Hoang, and Dr. Paul van der Mark from FSU Research Computing Center (RCC) for their research in securing high-performance computing. This project, titled “CICI:  RSARC:  DICE – Data Insurance in the Cluster Environment”, was awarded by the NSF directorate CISE:OACI. read more Teaching Faculty Moves in Computer Science at FSU Jul 6, 2017 Specialized faculty member Caitlin Carnahan to study Physics at Carnegie Mellon, Sharanya Jayaraman to fill faculty line. read more « Older Entries Next Entries »"}