{"url": "www.cs.fsu.edu/research/technical-reports/", "text": "Technical Reports | Technical Reports 2017 TR-171030 Shuanglong Zhang, An-I Andy Wang “FJS: Fine-grained Journal Store” TR-170929 Weisu Wang, Christopher Meyers, An-I Andy Wang, Sarah Diesburg “Tags: A Unifying Primitive for the Storage Data Path” 2016 TR-160201 Robert Roy, Britten Dennis, An-I Andy Wang “The Legend File System: Better Reliability through Implicit Replicas” 2015 TR-150921 Shuanglong Zhang, Helen Catanese, An-I Wang ” The Composite-file File System: Decoupling the One-to-one Mapping of Files and metadata for Better Performance” 2014 TR-141209 Michael Mitchel, An-I Wang, Peter Reiher. “Cashtags: Prevent Leaking Sensitive Information through Screen Display” TR-140715 Guanyu Tian, Zhenhai Duan, Todd Baumeister, Yingfei Dong “Reroute on Loop in Anonymous Peer-to-Peer Content Sharing Networks” 2013 TR-131104 Michael Mitchell, An-I Andy Wang, Peter Reiher “Mobile Usage Patterns and Privacy Implications” TR-130627 Ben Buzbee, Weisu Wang, An-I Andy Wang “Power-Saving Approaches and Tradeoffs for Storage Systems” TR-130611 Wei Hu, Jin Xie, and Zhenghao Zhang “The Complexity of the Routing Problem in POR” TR-130114 Zhenhai Duan, Guanyu Tian, Todd Baumeister, and Yingfei Dong “A Traceback Attack on Freenet” 2012 TR-121106 Zhenhai Duan and Fernando Sanchez “A Sender-Centric Approach to Detecting Phishing Emails” TR-120131 Santonu Sarkar, Sayantan Mitra, and Ashok Srinivasan “Reuse and Refactoring of GPU Kernels to Design Complex Applications” 2011 TR-111220 Santosh Mahapatr, Xin Yuan, and Wickus Nienaber “Limited Multi-path Routing on Extended Generalized Fat-trees” TR-111020 Sarah Diesburg, Chrisopher Myers, Mark Stanovich, Michael Mitchell, Justin Marshall, Julia Gould, An-I Andy Wang, and Geoff Kuenning “TrueErase: Full-storage-data-path Per-file Secure Deletion” TR-110418 Yanan Yu and Ashok Srinivasan ” Hybrid Dynamic Iterations for the Solution of Initial Value Problems” TR-110415 Mike Burmester and Daniel Miller ” Ad hoc subgroup proofs for RFID ” 2010 TR-100901 Zhenhai Duan, Peng Chen, Fernando Sanchez, Yingfei Dong, Mary Stephenson, and James Barker ” Detecting Spam Zombies by Monitoring Outgoing Messages” TR-100401 Ted Baker ” What to Make of Multicore Processors for Reliable Real-Time Systems?” TR-100315 Xin Yuan ” On Nonblocking Folded-Clos Networks in the Computer Communication Environment” 2009 TR-091026 Mark Stanovich, Theodore P. Baker, An-I Wang, and Michael Gonzalez Harbour ” Defects of the POSIX Sporadic Server and How to Correct Them” TR-090901 Sereyvathana Ty, James Shirley, Xiuwen Liu, and David M. Gilbert ” FISH FINDER: A High-Throughput Tool for Analyzing FISH Images” TR-090731 Samidh Chatterjee, Michael Connor and Piyush Kumar ” Geometric Minimum Spanning Trees with Filter-Kruskal” TR-090217 Zhenghao Zhang, Steven Bronson, Jin Xie and Hu Wei ” The One-Sender-Multiple-Receiver Technique and Downlink Packet Scheduling in Wireless LANs ” TR-090120 Subhajit Datta, Robert Van Engelen and Andy Wang ” Predictux: A Framework for Predicting Linux Kernel Incremental Release Times ” TR-090121 Subhajit Datta and Robert Van Engelen ” Project-entropy: A Metric to Understand Resource Allocation Dynamics across Software Projects ” 2008 TR-080906 T. Nagaraju, P.K.Baruah and Ashok Srinivasan ” Optimizing Assignment of Threads to SPEs on the Cell BE Processor” TR-080614 Donald Newell “A Review of the EveryoneCounts Vote Casting Applet” TR-080508 Sarah Diesburg and An-I Andy Wang “A Survey of Confidential Data Storage and Deletion Methods” TR-080406 Cory Fox, Dragan lojpur and An-I Andy Wang “Quantifying Temporal and Spatial Localities in Storage Workloads and Transformations by Data Path Components” 2007 TR-071025 Mark J. Stanovich, Theodore P. Baker, and An-I Andy Wang “Throttling On-Disk Schedulers to Meet Soft-Real-Time Requirements” TR-071015 Jin Qian and An-I Andy Wang “A Behind-the-Scenes Story on Applying Cross-Layer Coordination to Disks and RAIDs” TR-071005 Yixin Shou, Robert van Engelen, and Johnnie Birch “Flow-Sensitive Loop-Varient Variable Classification in Linear Time” TR-070724 M. K. Velamati, A. Kumar, N. Jayam, G. Senthilkumar, P.K. Baruah, R. Sharma, S. Kapoor, and A. Srinivasan “Optimization of Collective Communication in Intra-Cell MPI ” 2006 TR-061215 Murali Krishna, Arun Kumar, Naresh Jayam, Ganapathy Senthilkumar, Pallav K Baruah, Raghunath Sharma, Shakti Kapoor, Ashok Srinivasan “A Synchronous Mode MPI Implementation on the Cell BE Architecture” TR-061001 Theodore P. Baker “Brute-force determination of multiporcessor schedulability for sets of sporadic hard-deadline” TR-060725 Zhenhai Duan and Karthik Parsha “BCSQ: Bin-based Core Stateless Queueing for Scalable Support of Guaranteed Services” TR-060615 Todd R. Andel “Can Ad Hoc Routing Protocols be Shown Provably Secure?” TR-060608 Zhenhai Duan, Xin Yuan, and Jaideep Chandrashekar “Controlling IP Spoofing based DDoS Attacks Through Inter-Domain Packet Filters” TR-060606 Michael Hines, Mark Lewandowski, Jian Wang, and Kartik Gopalan “Implementation Experiences in Transparently Harnessing Cluster-Wide Memory” TR-060605 Eric Hokanson “Tracing Faults in MANETs Using Symmetric Authentication Chains” TR-060602 Zhenhai Duan, Kartik Gopalan, and Xin Yuan “Behavioral Characteristics of Spammers and Their Network Reachability Properties” TR-060601 Theodore P. Baker and Sanjoy K. Baruah “Schedulability Analysis of Multiprocessor Sporadic Task Systems” TR-060501 Theodore P. Baker, Michele Cirinei “A necessary and sometimes sufficient condition for the feasibility of sets of sporadic hard-deadline tasks” TR-060401 Theodore P. Baker, Michele Cirinei “A unified analysis of global EDF and fixed-task-priority schedulability of sporadic task systems on multiprocessors” TR-060328 Mike Burmester, Tri van Le “Optimistic Tracing in MANET” TR-060323 Charles Weddle, Mathew Oldham, Jin Qian, An-I Andy Wang “PARAID: The Gear-Shifting Power-Aware RAID” TR-060318 Goce Jakimoski and Mike Burmester “Using Faulty Flows in AND/OR Graphs to Model Survivability and Reliability in Distributed Systems” TR-060208 Kartik Gopalan, Navodaya Garepalli and Ping Yang “Ad hoc Bridging Protocol” TR-060112 Christy Chatmon, Tri van Le and Mike Burmester “Secure Anonymous RFID Authentication Protocols” 2005 TR-051221 Shelly Rush “An Analysis of the Capability Maturity Model” TR-051220 A. Mahajan, N. Potnis, K. Gopalan, and A. Wang, “Evaluation of Mobility Models for Vehicular Ad-hoc Network Simulations” TR-051201 Theodore P. Baker, Nathan Fisher, and Sanjoy Baruah, “Algorithms for Determining the Load of a Sporadic Task System” TR-051116 A. Srinivasan and B. Bouta “Comparison of Monte Carlo Linear Solvers in Load-Balancing Applications” TR-051101 Theodore P. Baker “A Comparison of Global and Partitioned EDF Schedulability Tests for Multiprocessors” TR-051001 Theodore P. Baker “Further improved schedulability analysis of EDF on multiprocessor platforms” TR-050730 Ilkay Cubukcu, “Formally Evaluating Wireless Security Protocols” TR-050601 Comparison of Empirical Success Rates of Global vs. Partitioned Fixed-Priority EDF Scheduling for Hard Real Time TR-050426 Ashok Srinivasan, Yanan Yu, “Scalable Parallelization of Molecular Dynamics Simulations in Nano Mechanics, through Time Parallelization” TR-050425 Hang Wu,”Real Estate Listing Web ApplicationUsing Microsoft .NET Framework SDK1.1 and SQL2000″ (Masters thesis supervised by Dr. Daniel G. Schwartz) TR-050417 Matthew Rice,”Legally Resilient Signatures: A Middle-age Approach to a Digital Age Problem” (Masters thesis supervised by Dr. Mike Burmester) TR-050410 Michael R. Hines,”An Adaptive Network Memory Engine” (Masters thesis supervised by Dr. Kartik Gopalan) TR-050409 Qiang Zhang,”Appearance-based Classification and Recognition using Spectral Histogram Representations and Hierarchical Learning for OCA.” (Masters thesis supervised by Dr. Xiuwen Liu) TR-050331 Zhenhai Duan, Kartik Gopalan “Push vs. Pull: Implications of Protocol Design on Controlling Unwanted Traffic” TR-050330 J. McDonald, Alec Yasinsac, W. Thompson “Trust in Mobile Agent Systems” TR-050329 J. McDonald, Alec Yasinsac, W. Thompson “A Survey of Mobile Agent Security” TR-050323 R. Gabrielle Reed “TuLiP, A Teacher’s Tool for Lesson Planning” (Masters Thesis supervised by Dr. Lois Hawkes) TR-050201 T. P. Baker, “An Analysis of Fixed Priority Schedulability on a Multiprocessor” TR-050128 Michael R. Hines, Mark Lewandowski, Kartik Gopalan, “Anemone: Adaptive Network memory Engine” TR-050111 Jiangyi Hu, “Cooperation in Mobile Ad Hoc Networks” 2004 TR-041223 Robert A. van Engelen, “The CR# Algebra and its Application in Loop Analysis and Optimization” TR-041206 Ahmad Faraj, Xin Yuan, “Message Scheduling for All-to-all Personalized Communication on Ethernet Switched Clusters” TR-041201 Robert A. van Engelen, Johnnie Birch, Yixin Shou, Klye A. Gallivan, “Array Data Dependence testing with the Chains of Recurrences Algebra” TR-041112 Christopher G. Baker, “A Block Incremental Algorithm for Computing Dominant Singular Subspaces” (Masters Thesis supervised by Dr. Kyle Gallivan) TR-041025 Zhenhai Duan, Yingfei Dong, Kartik Gopalan, “DMTP: Controlling Spam Through Message Delivery Differentiation” TR-041024 Srikanth Bolisetty, “A Fault Tolerant Error Detection and Verification Approach” (Masters Project supervised by Dr. Lois Hawkes) TR-041021 Alec Yasinsac,Thompson W., McDonald J., “Cryptoprogramming: A software Tamper Resistant Mechanism Using Runtime Pathway Mappings” TR-041011 Susmitha Athota, “The Real Estate Listing Web Service Using IBM Websphere and DB2” (Masters project supervised by Dr. Daniel G. Schwartz) TR-040831 Kiran Kaja, “WSDL Importer” (Masters project supervised by Dr. Robert van Engelen.) TR-040718-1 TR-040718-2 Almas Ansari, “Topology Aggregation for Networks with Two Additive Metrics” (Masters thesis supervised by Dr. Xin Yuan.) TR-040504 Ashok Srinivasan, “Latency and fault tolerance through parallelization of time with applications to nano-materials simulation” TR-040503 Melissa Kryder, “Predator and Prey Alert System” (Masters thesis supervised by Dr. Mike Burmester.) TR-040502 Khandys A. Polite, “PPDA: Privacy Preserving Data Aggregation in Wireless Sensor Networks” (Masters thesis supervised by Dr. Alec Yasinsac.) TR-040501 Smita Kulkarni,”Distributed file access with web-services.”(Masters project supervised by Dr. Robert van Engelen.) TR-040302 Donghu Sun,”A study of Image representations for content-based image retrieval”(Masters thesis supervised by Dr. Xiuwen Liu) TR-040301 JaRay Jasper,”Extending the Coroner’s Toolkit via Aggregate Database” (Masters project supervised by Dr. Lois Hawkes) TR-040203 Stoecklin, S., Schwartz, D.G., Yilmaz, E., and Patel, M., “A Metadata Architecture for Case-Based Reasoning”. TR-040202 Patel, M., Stoecklin, S., and Schwartz, D.G., “Graphical User Interface Using a Reflective Architecture and XML”. TR-040201 FRR: a Proportional and Worst-Case Fair Round Robin Scheduler (X. Yuan and Z. Duan) TR-040101 Rajkeerat Singh Sethi, “Graduate Tuition Waiver System” (Masters project supervised by Dr. Lois Hawkes) 2003 TR-031101 Sergio Souza,”Experimenting with Technologies for Development and Integration of Distributed Systems” (Masters project supervised by Dr. Riccardi). TR-031001 Rohith Gowda, “A Telecom Billing Application” (Masters project supervised by Dr. Engelen). TR-030902 Yaohang Li, “A Grid Computing Representation for Monte Carlo Applications ” (Doctoral thesis supervised by Dr. Mascagni). TR-030901 Xi Rao, “Yahoo Database Project: Super Search Application” (Masters project supervised by Dr. Schwartz). TR-030802 “An attack on the Domingo-Ferrer and Herrera-Joancomarti fingerprinting scheme”, Dr. Mike Burmester, Jiangyi Hu and Yong Cheng TR-030801 “Implementing an Object Oriented, Knowledge Based Network Reference Monitor and Intrusion Detection System”, Dr. Alec Yasinsac , Edwin A. Melendez, Sachin Goregaoker TR-030702 “Content Markup Language Design Principles”, Andreas Strotmann (Doctoral thesis supervised by Dr. Kohout) TR-030701 “A Modular Data Pipelining Architecture(MDPA) for enabling Universal Accessibility in P2P Grids”, Sangmi Lee (Doctoral thesis supervised by Dr. Erlbacher) TR-030604 “Performance Driven Optimization Tuning in VISTA”, Prasad Kulkarni (Masters thesis supervised by Dr. Whalley) TR-030603 “XML Transformer Web Service, XML – SQL Web Application”, Sami Sarhan (Masters project supervised by Dr. Riccardi) TR-030602 “Towards efficient compilation of the HPJava Language for High Performance Computing”, Han-Ku Lee (Doctoral thesis supervised by Dr. Erlbacher) TR-030601 “Platforms for HPJava : Runtime Support for Scalable Programming in Java”, Sang Boem Lim (Doctoral thesis supervised by Dr. Erlbacher) TR-030502 “An analysis of the secure routing protocol for mobile adhoc network route discovery : Using intuitive reasoning and formal verification to identify flaws.”, John D. Marshall II (Master’s thesis supervised by Dr. Yasinsac) TR-030501 “Adaptive Case-Based Security Framework for Critical Infrastructure Protection”, Erbil Yilmaz (Master’s thesis supervised by Dr. Schwartz) TR-030404 “The Ramifications of E911”, Kristin Burke and Dr. Alec Yasinsac TR-030403 Kristin Burke,”Group Key Generation in Wireless Ad Hoc Networks Using a Subgroup Method”(Master’s thesis supervised by Dr.Yasinsac) TR-030402 Anna Suen,”Mobile Agent Protection with Data Encapsulation and Execution Tracing”(Master’s thesis supervised Dr.Yasinsac) TR-030401 “Multiprocessor EDF and Deadline Monotonic Scheduling Analysis”, Dr. T.P. Baker TR-030302 “A Graphical Display of the Snort Rule Set” (Master’s project supervised by Dr. L.W.Hawkes) TR-030301 “An Analysis of Deadline-Monotonic Schedulability on a Multiprocessor”, Dr. T.P. Baker TR-030205 Mahesh Kumar Patel, “A Modernized Version of Visual Cryptography” (Master’s thesis supervised by Dr. Desmedt) TR-030204 Alain Coutu,”Automated Refactoring Tool” (master’s project supervised by Dr. Sara Stoecklin) TR-030203 “Improved Monte Carlo linear solvers through non-diagonal splitting”, Dr. Ashok Srinivasan TR-030202 “An Analysis of EDF Schedulability on a Multiprocessor”, Dr T.P.Baker TR-030201 William Kreahling, “Branch Elimination by Condition Merging”, supervised by Dr. David Whalley 2002 TR-021204 Syed Yasir Abbas, “Introducing Multi Threaded Solution to Enhance the Efficiency of Snort (An Intrusion Detection System)” (master’s project, supervised by Dr. Lois Hawkes) TR-021203 Tysen Leckie, “Anomaly-based Security Protocol Attack Detection”(master’s thesis, supervised by Dr. Alec Yasinsac) TR-021202 Stephen Carter, “Secure Position-Aided AdHoc Routing” (master’s project, supervised by Dr. Alec Yasinsac) TR-021201 Yu Wang, “A Dynamic Image Query System Using PHP”(master’s project, supervised by Dr. Xiuwen Liu) TR-021001 Kavitha Bangalore, ” A Minimum Interference Hybrid Algorithm for MPLS Networks” (master’s project, supervised by Dr. Xin Yuan) TR-020702 Santosh Hari, “A Graduate Admissions Database System” (master’s project, supervised by T. Baker) TR-020701 Erbil Yilmaz, Yanet Manzano, “Surveying Formal and Practical Approaches for Optimal Placement of Replicas on the Web” (student paper) Replicating content has become one of the most employed techniques to solve the currently experienced slow download time and rapidly growing demand for web contents. However the effectiveness of the solution may dramatically decrease without optimization. In this paper we survey the lately proposed solutions to optimize the placement. TR-020603 (reserved for Josh Grant master’s thesis) TR-020602 Raja Ramaswamy, “Analysis of SET Protocol in CPAL-ES” (master’s project, supervise by A. Yasinsac) TR-020601 Saeed Tarokh, “Building an Algorithm for Knowledge Representation using LDAGs” (master’s project, supervised by D. Schwartz) TR-020405 Xin Yuan and Jun Zhou, “Dynamic Routing and Wavelength Assignment with Imprecise State Information” TR-020404 Greg Riccardi and Anatoly Reznik, “Evaluation of Web Application Server Technology” TR-020403 Alec Yasinsac and Jenny Frazier, “Creating a Security Laboratory Environment for Education, Research and Outreach” TR-020402 Lois Hawkes and Stephen Oberther, “pTools: Process Information Utilities” TR-020401 Gregory Riccardi and Lakshmi Valsalakumari, “An XML – Database Interface System” TR-020302 Alec Yasinsac and James A. Davis ( Iowa State University ), “Modeling Protocols for Secure Group Communication in AdHoc Networks” TR-020301 Alec Yasinsac and Sachin Goregaoker, “An Intrusion Detection System for Security Protocol Traffic” 2001 TR-011203 Nikhil Patel, “Knowledge Base for Intrusion Detection System” TR-011202 Marion Bogdanov, “An Approach to Developing an Information Assurance Environment” TR-011201 Ted Baker and Nikhil Mhatre, “A comparative performance analysis of real-time priority queues” TR-011101 Gregory Riccardi and Wenzhong Cao “Java Servlets and User Interfaces for On-line Database” TR-010801 Xin Yuan and Arif Saifee, “Path Selection Methods for Localized Quality of Service Routing” TR-010704 Xin Yuan and Wei Zheng, “A Comparative Study of Quality of Service Routing Schemes That Tolerate Imprecise State Information” TR-010703 Sachin Goregaoker , “A Method For Detecting Intrusions on Encrypted Traffic” TR-010701 Alex Melendez , “The Monitor and the Prinipals” TR-010602 Weijuan Shi , “Implementation and Performance of POSIX Sporadic Server Scheduling in RTLinux” TR-010601 Alec Yasinsac , and Michael P. Runy, “The Weakest Procondition Protocol Analysis Environment” TR-010503 Ryan G. Lane, Daniels Scott, and Xin Yuan , “A Comprehensive Evaluation of Reliable Multicast Protocols over Ethernet-Connected Networks” TR-010502 Michael P. Runy, “The CPAL-ES Protocol Analysis Environment” TR-010501 Apan Qasem , David Whalley , Xin Yuan , and Robert van Engelen , “Using a Swap Instruction to Coalesce Loads and Stores” TR-010404 B.Cai and David Whalley ,”Compiler Modifications to Support Interactive Compilation” TR-010403 A.Qasem and David Whalley ,”Using a Swap Instruction to Coalesce Loads and Stores” TR-010402 Ashley Board , “An Investigation of XML and XML Tools in Java” 2000 TR-001205 Gunjan Gupta , “A Simple Object Access Protocol (SOAP) Stub Compiler for C” TR-001204 Diana Orrick , “Customization of the Remedy Action Request System for FSU User Services” TR-001203 Michael Ranney, “A Model for the Next-Generation of Business Automation Environments” TR-001202 Ryan G. Lane , “A Comprehensive Study of Reliable Multicast Protocols over Ethernet-Connected Networks” TR-001201 Raymond R. Curci , “Florida State University Computer Science Internet Teaching Lab” TR-001101 Baosheng Cai , Wankang Zhao , David Whalley , Robert van Engelen , Xin Yuan , Jack Davidson, and Kyle Gallivan , “VISTA: Vpo Interactive System for Tuning Applications” TR-001001 L. W. Hawkes , Alec Yasinsac , C. Cline, “An Application of Visual Cryptography To Financial Documents” TR-000902 Yanet Manzano , “Policies to Enhance the Forensic of Computer Security” TR-000704 Yaohang Li , “The Computational Measure of Uniformity” TR-000703 Justin Childs , “Evaluating the TLS Family of Protocols with Weakest Precondition Reasoning” TR-000702 Xin Yuan and Xingming Liu, “Heuristic Algorithms for Multi-Constrained Quality of Service Routing” TR-000701 Xin Yuan , Hui Ding, Yuan Zhong, and Jie Zhang, “Resource Reservation Mechanisms for Distributed Multi–path Quality of Service Routing” TR-000601 Robert van Engelen , David Whalley , and Xin Yuan , “Automatic Validation of Code-Improving Transformations” TR-000401 Bruce Herring , “Testing the POSIX Socket Package” TR-000301 Samuel Joseph Eaves, II , “Managing Scientific Computations with a Java-Based Schema Extension Facility” TR-000102 Robert van Engelen , “Symbolic Evaluation of Chains of Recurrences for Loop Optimization” TR-000101 Alec Yasinsac , “Active Protection for Secure Security Services” 1999 TR-991201 Yuan Zhong and Xin Yuan , “Impact of Resource Reservation on Distributed Multi–path Quality of Service Routing Schemes” TR-990801 C.Healy and David Whalley ,”Automatic Utilization of Constraints for Timing Analysis” TR-990701 Xin Yuan , “On the Extended Bellman–ford Algorithm to Solve Two–Constrained Quality of Service Routing Problems” TR-990401 Y.Wang and David Whalley ,”Interprocedural Optimizations for Embedded Systems” 1998 TR-980801 M.Yang and David Whalley ,”Improving Performance by Branch Reordering” 1997 TR-971201 G.Uh and David Whalley ,”Effectively Exploiting Indirect Jumps” TR-970802 N.Yaqoubi and David Whalley ,”Reducing Timing Analysis Complexity by Partitioning Control Flow” TR-970801 R.Bowman and David Whalley ,”Decreasing Processor Memory Requirements by Overlappping Instructions” TR-970501 R.White and David Whalley ,”Bounding Worst-Case Data Cache Performance” TR-970401 E.Ratliff and David Whalley ,”Decreasing Processor Memory Requirements by Overlapping Run-Time Stack Data” 1996 TR-961201 R.Arnold and David Whalley ,”Bounding Instruction Cache Performance” 1995 TR-951201 C.Healy and David Whalley ,”Predicting Pipeline and Instruction Cache Performance” 1994 TR-940801 F.Mueller and David Whalley ,”Static Cache Simulation and Its Applications” 1993 TR-930801 M.Boyd and David Whalley ,”Graphical Visualization of Compiler Optimizations” 1991 TR-910401 F.Mueller and David Whalley ,”Avoiding Unconditional Jumps by Code Replication”"}