{"content": "Differences between the BS and BA in computer science | Differences between the BS and BA in computer science Differences between the BS and BA in computer science The BS in Computer Science (BS in CS) is considered the science track and the BA in Computer Science (BA in CS) is considered the humanities track. Also the BS in CS degree is accredited by the Computing Accreditation Commission of ABET, http://www.abet.org , and the BA in CS degree is not. The department encourages students to pursue the BS in CS if they are capable of completing it. We believe there will be more opportunities for BS in CS students after graduation, such as working for engineering and science firms. However, we do believe there will be significant opportunities for BA in CS students who are primarily interested in applications outside the sciences and engineering. The BA in CS is also an excellent track for students who are double majoring in another field outside the sciences and engineering. Because of reduced requirements in mathematics and theoretical computer science, the BA degree is not ABET accredited and students graduating with the BA in CS who wish to be admitted to the graduate program in CS at FSU may be required to take prerequisite undergraduate courses . This same policy is already in place for students who are admitted to graduate study in CS from other closely related majors, such as Mathematics and Computer Engineering. The BS in CS and BA in CS have the following differences in course requirements. MAC2312 (4) Calculus II, and MAD3105 (3) Discrete Math II are required for the BS in CS and are not required for the BA in CS. The probability course STA4442 (3) Introduction to Probability is required for the BS in CS. PHY2048C (5) General Physics I w/Lab and PHY2049C (5) General Physics II w/Lab are required for the BS in CS. In contrast, BA in CS students may instead satisfy the liberal studies science requirement by taking 7 hours of science courses from the approved list. COP4531 (3) Analysis of Data Structures and Algorithms and COT4420 (3) Theory of Computation, which have MAD3105 Discrete Math II as a prerequisite, are required for the BS in CS, but not for the BA in CS. The BA in CS will require 9 hours of humanities, which are not required for the BS in CS. The BA in CS will require additional hours of general electives that are not required for the BS in CS degree. The BS in CS has a collateral interdisciplinary minor. BA in CS students will likely need to select a minor in another subject, which could overlap with the 9 hours of humanities and/or the additional hours of general electives.", "meta": {"url": "www.cs.fsu.edu/academics/undergraduate-programs/differences-between-the-bs-and-ba-in-computer-science/"}}