{"content": "Web Advisor | Web Advisor This Web Advisor is designed to complement the traditional advising process in Computer Science. All students in the CS department should meet with their Computer Science Undergraduate Academic Advisor prior to registration to discuss their options for the upcoming semester(s). There are four different degree programs within the Computer Science Department at FSU: the B.S. in Computer Science, the B.A. in Computer Science, the B.S. in Cyber Criminology, and the B.S. in Computational Biology. Please review the Undergraduate Program webpage for detailed information on each of these majors. Computer Science Academic Maps An Academic Map is available to assist students in creating schedules for any major at FSU. This plan is based upon the current course requirements and is subject to change. You may use this four-year plan as a general guide, but always check with your Computer Science Academic Advisor at least two weeks prior to your registration date to verify that you are taking the best classes for you. Liberal Studies & Other General Degree Requirements Complete information on Liberal Studies, Oral Competency, Computer Competency, and the “X” and “Y” Multicultural Requirements can be found through the Division of Undergraduate Studies and the latest version of It’s All Academic . In general, given the number of prerequisites CS majors must complete, we advise students to find liberal studies courses that satisfy multiple requirements at the same time. For example, a given humanities course might be literature-based (*), Gordon Rule (w), and Cross Cultural (x). The following includes some notes about how CS students typically complete Liberal Studies and other general requirements: Math : This is satisfied through the math courses any CS student will take for their degree. Natural Science : BS in CS and Computational Biology students have specific Natural Science courses they must take for their respective degree programs. Other degree programs have more flexibility. English Composition : Students must complete the freshman composition sequence within their first year at the University. This is a mapping requirement. History : Possible source of “x” or “y” courses. Likely source of “w” Gordon Rule writing courses. Social Science : Possible source of “x” or “y” courses, as well as a few “w” Gordon Rule writing courses. Humanities/Fine Arts : Possible source of “x” or “y” courses. Likely source of “w” Gordon Rule writing courses. Oral Communication Competency Requirement : CIS 4250 Ethics and Computer Science meets the Oral Competency requirement of the University. This is a required course for BS in CS majors. x (Cross Cultural) and y (Western Diversity) multicultural courses. Select at least one “x” course and one “y” course when selecting your History/Social Science and Humanities/Fine Arts courses. You can find out which courses are “x” and “y” in It’s All Academic . Gordon Rule (Writing) Courses: Gordon Rule classes are designated by a “w” in It’s All Academic . College of Arts and Science Requirements The Computer Science Department is part of the College of Arts and Sciences. In addition to University requirements, students with major codes within Arts and Sciences must meet College of Arts and Sciences requirements . What Math Do I Take Next? Select your HIGHEST math course “passed/accepted” after the current semester, whether taken at FSU or accepted by dual enrollment, AP scores, or SAT/ACT scores. This is your next math course:", "meta": {"url": "www.cs.fsu.edu/academics/undergraduate-programs/web-advisor/"}}