{"content": "Cybersecurity Major in MS in Computer Science Program | Cybersecurity Major in MS in Computer Science Program The number of hours for the graduate degree as described on this web page will be effective in Summer 2018. In all majors, a student must complete thirty semester hours in computer science courses numbered 5000 or above, including approved CIS 5930 and CIS 6930. At most, one course outside the department at the 5000 or 6000 levels can also count towards the 30 hours if approved by the department chair after the major professor justifies why the outside course is important for the student’s research. Supervised teaching, supervised research, seminars, directed individual study, internship, and courses with prefix CGS are excluded. Cybersecurity students must complete the undergraduate prerequisites listed below before graduating and will have to complete a subset of these courses before being admitted to the MS Cybersecurity major. Undergraduate Pre-requisites for MS Cybersecurity degree: CDA 3100 Computer Organization I (3) COP 4530 Data Structures, Algorithms and Generic Programming (3) COP 4610 Introduction to Operating Systems (3) COT 4420 Theory of Computation (3) COP 4521 Secure Parallel and Distributed Computing with Python (3) CIS 4360 Introduction to Computer Security (3) A student in the Cybersecurity major is required to take the following graduate courses: CIS 5370 Computer Security (3) CIS 5371 Cryptography (3) CNT 5412 Network Security, Active and Passive Defenses (3) CNT 5505 Data and Computer Communications (3) CNT 5605 Computer and Network Administration (3) CIS 5627 Offensive Computer Security (3) CAP 5137 Software Reverse Engineering and Malware Analysis (3) This major also includes the award of a Cyber Security Major Certificate. Students are not required to apply to the general CS MS degree beforehand and are allowed to directly apply into the Cyber Security Major MS program.", "meta": {"url": "www.cs.fsu.edu/academics/ms-cyber-security/"}}