{"content": "FAQ for Majors in the Computer Science Department | FAQ for Majors in the Computer Science Department Holds: 1.\tI have a hold on my account. How can I remove it? A.\tAcademic advisors can lift map term off track and D/F holds. i.\tMap Term Off Track & D/F Warning Holds: Please schedule an appointment or attend drop-in advising. ii.\tD/F Dismissal holds: Please change your major before emailing advisor@cs.fsu.edu to lift this hold. B.\tFor all other holds, click on the hold and read the details for instructions and contact information. For any questions, contact the department listed on the hold. 2.\tI have a graduation progress check hold but am not graduating. Can an advisor lift it? A.\tAdvisors cannot lift these holds. Graduation Progress Check holds are just that—a check to see where you are in terms of graduating and to see what you have left to graduate. It does not mean you are graduating right now. B.\tClick on the hold and follow the directions to remove it. Note that both the Registrar and College of Arts and Sciences put holds on student accounts for Graduation Progress Checks, so make sure to complete both to remove the holds. Enrolling/Schedule Planning: 1.\tCan I take this class pass/fail (S/U)? A.\tGenerally, CS majors will only take their foreign language courses as S/U. No major, minor, or Liberal Studies requirement courses may be taken S/U. B.\tSubmit the request online in Student Central by the 7th-week deadline. See instructions here: https://registrar.fsu.edu/training/su_grade_request . 2.\tI am trying to enroll in an online CS course but received an error message. Can an advisor enroll me? A.\tCS Majors may not take CS Distance Learning courses. These courses are reserved for the Distance Learning program. Fall 2020 CS courses will have the “location” listed as “remote.” CS major courses with a “location” of “online” are reserved for Distance Learning. 3.\tMy registration opened. Can an advisor tell me what to take? A.\tYour academic advisor will be happy to advise you on course options if you attend drop-in advising or schedule an appointment. B.\tTo get started, however, students can also check these resources: i. My Academic Requirements ii. CS Major Flowcharts iii. Academic Program Guide 4.\t(Upper-division students) I want to graduate soon. Can my advisor tell me what I have left to take? A.\tSure! First, refer to your College of Arts and Sciences Progress Check (pick it up from 010 Longmire or email as-progresscheck@fsu.edu ) and your major’s flowchart. Then, see an advisor. 5.\tCan you tell me what CS electives are offered and when? A.\tCS electives change every semester, so we email out the list to the majors listserv after the schedule posts each semester (February and October). Check your email or contact advisor@cs.fsu.edu. 6.\tHow can I drop a course from this semester? A.\tCourses can be dropped without grade liability until the 7th-week deadline. Courses can be (“late”) dropped with a W until the 12th-week deadline. Upper-division students are allowed ONE (1) late drop at FSU. Deadlines are posted on the Registrar’s Academic Calendar each semester. First, double-check with FSU Financial Aid. Then, watch this video for instructions. 7.\tHow can I sign up for the Foreign Language placement test? A.\tSign up here: https://www.registerblast.com/fsu/Exam/List B.\tMore information on Foreign Language Exemption & Placement: https://www.modlang.fsu.edu/students/undergraduate-advising/exemption-placement Graduation 1.\tI didn’t apply for graduation but am supposed to graduate this semester! How can I do that? A.\tSee the upper division advisor for a Graduation Clearance form, then contact the College of Arts & Sciences at as-advising@fsu.edu to ask to be late-added to the graduation list. 2.\tI applied for graduation. What am I supposed to do now? A.\tGo through the Graduation Checklist on the Registrar’s page: http://registrar.fsu.edu/graduation/checklist/ . Complete your Financial Aid exit interview and CS department exit surveys (part 1 and part 2) and you should be good to go. Complete your classes with a C- or better.", "meta": {"url": "www.cs.fsu.edu/academics/advising/faq-for-majors-in-the-computer-science-department/"}}