{"content": "Portfolio | Portfolio PhD Student Portfolio Guidelines The portfolio is the principal artifact used by the department to monitor progress of doctoral students and to determine if a student is ready to take the Doctoral Qualifying Exam, which is a required component of admission to candidacy. This document is intended as a guide to the portfolio component of these requirements. Adhering to these guidelines is a requirement for continuing in the doctoral program. Portfolio Requirement Every Computer Science doctoral student is required to assemble and submit a portfolio for review no later than the date specified under Portfolio Calendar below. Portfolios are reviewed on a regular basis (generally once a year, during the Spring term) by the Portfolio Evaluation Committee (PEC), a faculty committee appointed by the department chair. Feedback to the student on portfolio contents and on progress towards admission to candidacy is provided as a result of these reviews. New portfolios should be submitted to the student’s academic advisor for preliminary review. The advisor may suggest that the student make modifications. Students should print the cover page form and include the form with the Portfolio for submission to the academic advisor for review. When the advisor is satisfied, the advisor will sign the cover page form and transmit the portfolio on to the PEC. Admission to candidacy for the PhD degree consists of two milestones: CIS 8962 Doctoral Qualifying Exam CIS 8964 Doctoral Preliminary Exam (Area Exam) A grade of “P” must be earned in both of these. Normally the Doctoral Qualifying Exam would precede, or at least occur in the same semester as, the Area Exam. See below under Portfolio Review and Qualifying Exam for the procedure to follow. Portfolio Calendar During the first semester in the program , the student should assemble a portfolio and submit it to the department office through the student’s academic advisor. This initial portfolio should be submitted as soon as possible, but in no case later than the end of the first semester. (It is understood that the portfolio will not be complete at this point.) Every Fall and Spring semester prior to the student’s admission to candidacy, the student is required to maintain the currency of the portfolio by updating it, asking his or her advisor to review it, and obtaining the advisor’s signature on the portfolio cover page form , by the end of the second week of the semester. At least once a year , typically in the Spring, the portfolio will be reviewed by the Portfolio Evaluation Committee. The result of the review will be advisory in nature. When the student wishes to take the Doctoral Qualifying Exam : For the term in which the student wishes to take the Doctoral Qualifying Exam, the student should enroll in the course CIS 8962 Doctoral Qualifying Exam . In order for the student to register for the Qualifying Exam the student’s and the student’s major professor must sign a portfolio cover page form indicating that the professor has reviewed the portfolio and considers it complete . The CIS 8962 Doctoral Qualifying Exam will be scheduled during that semester. Full time students entering with a Masters in Computer Science should normally expect to take the Qualifying Exam near the end of their first year. Full time students entering directly from a Bachelor’s degree in Computer Science should normally expect to take the Qualifying Exam near the end of their second year. For all students, the CIS 8962 Doctoral Qualifying Exam should normally occur soon after the core course requirements have been met. After admission to candidacy , the portfolio should not be modified. It will be archived by the department staff. Copies of the progress reports prepared by the student’s major professor should be placed in the student’s regular departmental advisement file. Portfolio Content & Organization Every student in the FSU Computer Science doctoral program is required to prepare a three-ring binder containing as much as possible of the information described below. For each major section, please begin the corresponding section in your binder with a tabbed separator labeled so as to identify the section heading. All sections are required to be included. Summary Data Complete the following table on personal information: Personal Information Your Name: Your FSUSN: Date entered program (semester/year): Full or part time student? Principal source of support: Give the names of your dissertation advisor and other committee members. If the committee has not yet been formed, please indicate this with ‘TBD’. Note that advance into candidacy can only be approved when a committee has been appointed. Doctoral Committee Major Professor / Advisor Committee Member Committee Member Committee Member External Committee Member Complete the following table on core courses (see the Graduate Bulletin for information on the core course requirements). You must complete four (4) core courses in total: at least one course from each of the three core areas. List these four core courses in the table below. Note that only those core courses you completed with a grade of B or higher will count towards the complete set of four, so only list the core courses with a grade of B or higher: Core Graduate Courses and Grades Core Area Core Course Semester Taken or Planned Name of Instructor Grade Received Software Systems Theory Any If you are requesting that courses taken at other institutions be counted toward the core, please provide supporting documentation showing the equivalence. In addition, our department’s Director of Graduate Studies or another qualified graduate faculty member has to make an examination and determine that the course is equivalent. Obtain a letter or memo signed by this person and put a copy in the portfolio. In any case, include in your portfolio a copy of the course syllabus, including at least the information about the prerequisites, topics, and textbook or other references used, and copies of whatever graded work (examinations, projects, etc.) you have retained from the course. In general, to be equivalent, a course must be a graduate course, with similar prerequisites, a similar list of topics, and similar performance expectations. For example, a course in operating systems will not be considered equivalent to COP 5611 unless it is a “second semester” course, i.e. one for which there is another operating systems course like COP 4610 as prerequisite. For the theory area, the course grade must be based on the ability to do mathematical proofs. For the software area, the course must involve substantial hands-on software development, with a mature level of documentation and testing. Complete the following table on elective courses, including all the graduate courses you have taken (including thesis and DIS courses) that are not in the list of core courses above. Elective Courses and Grades Elective Course Semester Taken or Planned Name of Instructor Grade Received GPA for elective courses: Complete the following table for all area exams you have taken or plan to take. The last row should be the exam you have taken or plan to take for your current degree. Area Exams Exam Coverage Area Date of Exam (semester/year) Result of Exam State whether you have chosen a doctoral research topic and, if known, give a brief description of the proposed research. (one or two sentences) Curriculum Vitae The CV should contain the following information: Academic degrees: List all degrees you have earned to date, including for each degree the date it was conferred, the subject area, and the institution’s name and general location. Professional employment: List any teaching or research assistantships, any fellowships, and any nonacademic jobs providing training or experience in Computer Science or closely related areas. For teaching and research assistantships, indicate level of effort, e.g., whether these were 1/2 time, 1/4 time, etc. appointments. Honors and Awards: List any special academic honors, awards, or honor society memberships. Publications: List all published writings for which you are the author or a co-author. Service: Indicate anything you have done which either directly or indirectly benefited the department, university, or the Computer Science profession–e.g., officer of the student ACM chapter, reviewer for professional conference or journal, assistance at any professional conference, help at science fairs, service in local public schools, etc. Research Publications and Writing Begin this required section by repeating the publication list cited in your CV. Place a reprint or photocopy of one research publication or technical writing of which you were the primary author or writer , provided that: If the publication has three authors or fewer in total, then state the role you played in this publication, i.e., what was your role in the research and in the writing of the paper? If your writing was edited by a co-author (such as your advisor), then you should clearly indicate this. If all of your publications have four authors or more in total, or if you were not the person primarily responsible for writing the paper, or if you have no publications, then you must contribute a work of a research or technical nature which you personally created. This could be your Masters Thesis, or if you have not written a thesis, then some other research-oriented or technical writing, such as a term paper, or the area survey paper, or a technical report for which you were the primary author. Software Engineering A person holding the PhD in Computer Science is expected to have the ability to contribute substantially to significant software artifacts. As such, one such artifact is a required component of the doctoral portfolio. Include a copy of ONE such artifact, including design, engineering, and certification reports, software documentation , and actual code.A listing of unidentified uncommented code is not sufficient. The portfolio must include enough external documentation and internal comments for the reviewers to read and evaluate the scope and quality of the software. Some indication must be included of how the quality of the software was tested. If the software is something submitted for grade in a course, you should include the instructor’s statement of the assignment as external documentation, but that is not sufficient; the code must at least include internal comments. Similarly, for a course assignment you may provide the grade you received, and any comments the instructor made, as part of the “certification report”, but you also should explain how you tested it.For large projects, only indicative samples of the actual code need be included, but the full code should be available either on-line or as a separate document. If lengthy, these items may be submitted in a separate binder. If you include a CD containing materials, please include printed copy of at least some overview material, with pointers to the CD for the rest.If any of the software or documentation components are the work of more than one author, you must indicate what parts of these components you contributed to and estimate the percent of your personal contribution to each part. Moreover, it is best that you also include some examples of your individual work. Dissertation Research Write a 1-2 page abstract describing your intended area of dissertation research. Include indications of progress you have made. Support List all employment you have had while a graduate student in the department along with the begin/end dates of that employment. Include TA/RA positions, other work within FSU, as well as outside employment. We are interested in some detail, for example, if you are research assistant, describe the position, work requirements (in terms of both effort and outcome), and who the employer/supervisor is. This information is relevant both for the extent to which your activities support your educational objectives and the extent to which they may occupy your time in activities not related to your degree program. For each RA and TA position you have held at FSU, include here photocopies of your semesterly evaluation of performance in those positions. List all fellowship support you have while a student in our program. List the granting agency, the academic and ancillary requirements, and the amount of funding for each fellowship. Lectures All candidates for doctoral degrees in the department are required to participate in teaching activities at some time during their graduate careers, which will allow them to make an informed decision regarding whether or not they may wish to pursue a career in academia. Therefore, every candidate is required to either teach a course or serve as a recitation instructor for a course before they graduate. This experience can be part of their TA duties or can be obtained at another university prior to coming to FSU. In this section include supportive material that demonstrates lecture preparation and presentation material. Alternatively, include recitation presentation material in case you were assigned recitation responsibilities. This requirement can be waived by the Department chair in special circumstances only. When waived by the Chair, please include a copy of the memo. Documentation Supportive documentation should include: Previous Portfolio Reviews (when applicable)As discussed above, doctoral student portfolios will be reviewed regularly by the Portfolio Review Committee, and each student will be sent a letter indicating the committee’s evaluation of the student’s progress toward the degree. Photocopies of all such letters to date are to appear in this section of the portfolio. Transcripts To the extent these are available, include copies of your transcripts from prior institutions, i.e., universities or colleges you attended prior to your beginning as a graduate student in Computer Science at FSU. If you submitted transcripts with your application to our graduate program, the departmental staff can make photocopies of these for you from your application file, if you so request. GRE and TOEFL Score Reports (when available)In this section, place photocopies of the official reporting forms of your GRE and TOEFL scores reported in section 1 above. When you opt to omit it, the department will retrieve this information electronically. Area Exam Reports In this section place photocopies of the result reports from all area exams you have taken. Portfolio Review and Qualifying Exam The PhD Portfolio is intended to provide the department with a complete view of the student’s accomplishments and abilities that relate to likelihood of success as a PhD professional. The portfolio is reviewed regularly by the Portfolio Evaluation Committee to determine whether the student is making suitable progress towards the degree, and must be completed with a list of the satisfactory grades (B or higher) for the four core graduate courses when the student takes the Doctoral Qualifying Exam. Based on the completion of the portfolio, a student can enroll in CIS 8962 Doctoral Qualifying Exam. A passing grade “P” for the CIS 8962 Doctoral Qualifying Exam is one of the two required components of admission to candidacy. The student should be enrolled in CIS 8962 Doctoral Qualifying Exam when he or she has completed the four core graduate courses, completed the portfolio, and both the student and major professor agree that the student is ready to take the Doctoral Qualifying Exam. ( Doctoral Qualifying Exams may be scheduled for Fall or Spring semester, but not Summer semester.) The Portfolio Evaluation Committee will schedule and conduct the Doctoral Qualifying Exam during the semester. The exam will be oral and will cover the four core graduate courses taken by the student. The student will be tested on the four core graduate course topics. The student is strongly advised to study the core course topics well in advance in preparation for the Doctoral Qualifying Exam. A student cannot take the Doctoral Qualifying Exam if he or she has not completed the four core graduate courses. However, there is one exception to this rule. A student who has received satisfactory grades with a cumulative GPA of 3.5 or higher for all but one of the core courses can take the Qualifying Exam in the Spring term in which the last core course is being taken, assuming that the Qualifying Exams take place after spring break. In that case, the student is expected to be able to answer questions about all of the four core courses, including the core course currently being taken. If the student passes the oral, the exam is not recorded as passed until after the end of the term, and the chair of the Portfolio Evaluation Committee has verified that the remaining core course has been passed with an acceptable grade. In evaluating the portfolio for the Doctoral Qualifying Exam, no single aspect of the portfolio is taken as a determining factor, but rather an attempt is made to consider all strengths and weaknesses and to determine whether, overall, the student may reasonably be expected to succeed and become a credit to the department. Components of such success generally are as follows: General competency in Computer Science.In order to demonstrate adequate mastery of the breadth of Computer Science, we ordinarily expect a successful candidate to maintain a GPA of at least 3.5 in the core courses required for the degree . A GPA below 3.5 for the core courses is sufficient cause to deny permission to take the Qualifying Exam, unless convincing justifications are presented to the committee for consideration. Candidates may refer to the grading scale for PhD students in graduate courses that has been adopted by the department. The Portfolio Evaluation Committee may make exceptions to this GPA rule if it finds compelling evidence of exceptional strength in research. For example, a slightly lower GPA might be offset by published papers in reputable journals or conference proceedings. Note that the four core courses you took must be completed with a B or higher grade. If a student receives an A in a CS graduate core course at FSU, then the student is exempt from taking the exam. If you completed a core course with an unsatisfactory grade of B- or lower, do not list this course as a core course but list the course as an elective. Then sign up for another core course in that same core area to ensure you have taken four core courses, with at least one course from each core area.The Doctoral Qualifying Exam tests the general knowledge of the candidate in areas covered by the four core graduate courses. Research Aptitude.Research is a critical component of the PhD degree process and is a fundamental part of most professional positions that require a PhD as credentials. The department would like to admit to candidacy individuals who have demonstrated the ability, or aptitude, for research in the field. Software Skills.The creation of computer software is a fundamental part of computer science, and the department generally expects that its graduates possess the skills and training necessary to contribute to such endeavors. Communication Skills.The department wishes to see that the student has a capacity to express his or her thoughts in publication-quality English. Thus there is a requirement that the Portfolio contain some writing sample that demonstrates written communication skills, and the Doctoral Qualifying Exam serves to evaluate spoken communication skills. The writing requirement may be met by a professional publication, masters thesis, a masters degree project report, or any other writing that the student may have produced as part of his or her course work. Note that an ability to present one’s ideas in written English is considered as separate from an ability to conduct research, and that both abilities are deemed necessary.The department also wishes to see that the student is capable of responding extemporaneously to oral questions, as a researcher is required to do when presenting a paper at a conference and a professor is required to do when teaching. The Doctoral Qualifying Exam is a test of these oral communication skills. The student will be expected to be able to understand the questions presented by the examiners, and to answer them on the spot. PhD Grading Scale The Florida State University Department of Computer Science has adopted a grade interpretation scale for PhD students and any other students who take graduate courses in the department and may wish at some future time to enter the PhD program. Effective Fall 2002, grades in graduate courses taught by Computer Science Department faculty will use this grade interpretation scale. The scale is given by the following table. Course Grade CS Department Interpretation A Performance met or exceeded expectations for PhD students A- Performance met expectations for PhD students B+ Performance was marginally below expectations for PhD students B Performance was significantly below expectations for PhD students B- Performance was unsatisfactory for PhD students C+ or below Performance was unsatisfactory for graduate work Frequently Asked Questions Q: Can I substitute another course for one of the four required core courses? How about doing it just for the Portfolio Review, if I promise to take the course later?A: No. The Qualifying Exam is the point at which the Department checks for completion of the required core courses and the quality of work in those courses. Until you take the course we have no way to tell how well you will have done in the course.Of course, with adequate justification, departments at FSU are permitted to approve course substitutions in degree requirements. The PEC will only consider a substitution if the Portfolio contains a copy of a letter approving a course substitution for the degree requirements, signed by Director of Graduate Studies and the Department Chair. Q: I received a B- for a core course. Should I take another core course and have that one count towards to four core courses?A: Yes, you can choose another core course as long as you take at least three core courses to cover all three core areas as part of the total of four core courses you want to count towards the Qualifying Exam. Q: What kind of oral questions can I expect at the Qualifying Exam?A: That will be up to the individual members of the PEC. You should expect questions on the four areas: (a) general competency in CS; (b) research aptitude; (c) software skills; (d) communication skills. If the portfolio itself is strong, all or most of the questions are likely to be on (a). In area (a) the intent of the questions will be to gauge your understanding and retention of material normally covered in the four core courses and their undergraduate prerequisites. For example, if you have taken Automata and Formal Languages as part of your core requirement, you should not be take by surprise if you are asked to explain what is a finite state machine, what is the difference between a deterministic and a non deterministic finite state machine, what it means for a gramar to be ambiguous, how that compares to a language being inherently ambiguous, etc. .Be sure to have your major professor, and possibly others, help you prepare for such questions. Minimal preparation would include reviewing your notes from the core courses, and then answering some oral questions from each of the areas they cover.A big part of preparing for the exam is learning to be comfortable listening to questions, making sure you understand (by asking for clarification if necessary), and then expressing yourself clearly. You will have an easel and pen to write on. Plan to use it appropriately, to help with your answer. A “mock” oral examination is a good way to practice.Students who have not taken the core courses recently, or who have transferred credit for a core course from another institution, should expect to be asked more questions on the core courses, to verify that the knowledge has not become stale, and that the material learned is similar in scope and depth to what is covered in the corresponding course here at FSU. Similarly, if you took the course at FSU but your grade was not A or A-, you may expect more questions on that course. In area (b) you might expect questions concerning your research experience, your contributions to any research papers in your portfolio, your research plans, and the membership of your supervisory committee. In area (c) you might expect questions on what software you wrote, and the examples of software you included in your portfolio. In area (d) you might expect questions on the technical writing samples you included in your portfolio, but mainly the committee will be judging your communication skills by the manner in which you answer the questions about (a). That is: Can you understand the question? Can you ask appropriate questions for clarification? Can you give a clear answer? How well you do these things in the exam will be viewed as indication of your ability to function in a classroom, and as a speaker at a research conference. These are just examples, not intended to limit the options of individual committee members. Along with the questions, if the questions do not take up all of the available time, you can expect some encouraging words about the strong points of your portfolio, and some constructive advice as to how to proceed. Q: Can I take the Qualifying Exam during the summer term?A: No, or at least you should not count on it. Very few of the faculty are available during the summer as they tend to leave town to attend conference meetings. If there happen to be enough members of the PEC in town, an exam may be held in exceptional cases. Q: Can I do my Area Examination before my Qualifying Exam?A: Not officially. The course number for the Area Examination is listed as the Ph.D. Preliminary Examination, and the FSU Graduate Bulletin says that a student is admitted to Ph.D. candidacy by passing the Preliminary Examination. Our department’s faculty has set up the admission to candidacy as a two-step process. The necessary first step is the Qualifying Exam. In a few cases, for scheduling reasons, a student may go through the Area Examination process, but a passing grade for the Area Examination cannot be turned in until the student has completed the Qualifying Exam. If the are done the same term, this can work out. Students and advisors should take care about this. If, by some oversight, a passing grade for the Area Examination were to be turned in before the student passes the Qualifying Exam, the Department would need to revoke the passing grade on the Area Examination until the Qualifying Exam is passed. Q: What if I took courses at another institution, that I want to count toward my core requirement?A: First, you should have obtained some clearance for transfer credit when you were admitted, and you should put a copy of a letter or memo to this effect in your portfolio. Second, you should include in your portfolio the name of the textbook you used in the course, a copy of the course syllabus, and examples of graded exams and projects form the course. This will enable the PEC to gauge whether the course seems equivalent, and to know what sort of questions to ask during your oral examination on that area. Q: When will I know whether I passed?A: The PEC will probably wait to tell anyone until all of the students taking the Qualifying Exam that term have completed the exam. Q: Can I talk with other students about the exam, after I take it?A: You are asked not to discuss questions you were asked on the oral exam with anyone, until you are told the result of the exam. This allows us to be fairer to all students. For example, suppose you have trouble on a question. It may be that all students have trouble with that question, and the committee decides to disregard it. However, if you tell another student who is due to take the exam later, and the other student then looks up the answer and so answers better than you did, the committee may conclude that the question was not hard, and that you have no excuse for answering poorly. Q: Do I need to form my entire Ph.D. supervisory committee before I take the Qualifying Exam?A: This is not a requirement, but if you do not yet have your supervisory committee formed you need to do it right away, because you need the full supervisory committee before you can move on to the next step, which is the Area Examination. Q: Do I need to choose my research area before I take the Qualifying Exam?A: This is not a requirement, but if you do not yet have your area chosen you need to do it right away, since you can’t prepare for the CIS 8964 Preliminary Exam until you have chosen an area.", "meta": {"url": "www.cs.fsu.edu/academics/graduate-programs/portfolio/"}}