{"content": "Check Admission Status | Check Admission Status After submitting the online application, verify that all of your supporting materials have been received by doing the following: Application Fee of $30 – Verify at University Admissions Status Check a. Please note if this is not paid, you will not be able to verify if other materials have been received. If you are able to see information about test scores and transcripts, the fee has been received. b. For technical help in activating your FSUID, contact help@fsu.edu or 850-644-4357. Resume – Attached to the Online Application . Statement of Purpose – Attached to the Online Application . Transcripts and Degree Certificates – Sent to the Office of Graduate Admissions; Verify at University Admissions Status Check GRE scores – Sent Electronically by ETS, Verify at University Admissions Status Check Three Letters of Recommendation – Submitted Electronically by Recommenders, Verify through the Online Application (Int’l Students Only) TOEFL scores – Sent Electronically by ETS, Verify at University Admissions Status Check (Int’l Students Only) Certificate of Financial Responsibility (CFR) and Copy of Passport – Verify by e-mailing CGE-NewStudents@admin.fsu.edu If you are not missing any of the items listed above, consider your application complete. If you are missing any of these items, please do the following: If you did not receive the e-mail regarding the fee, you can still pay it at http://fees.fsu.edu or through the link on the Status Check screen at University Admissions Status Check Resume – Upload it to your online application. Statement of Purpose – Upload it to your online application. Transcripts and Degree Certificates – Mail to the Office of Graduate Admissions, 282 Champions Way, Tallahassee, FL 32306-2400 a. Questions regarding submission of transcripts and degree certificates should be directed to gradadms@admin.fsu.edu or 850-644-6200 GRE and TOEFL scores – Request that ETS submit the scores to FSU a. Questions regarding submission of test scores should be directed to gradadms@admin.fsu.edu or 850-644-6200 Three Letters of Recommendation – You can add or change recommenders in the online application. Send your CFR and Copy of Passport to the Center for Global Engagement, 110 S. Woodward Ave., Tallahassee, FL 32306-4216 a. If you’d like, in advance of the documents in the mail, you can send scanned copies to CGE-NewStudents@admin.fsu.edu", "meta": {"url": "www.cs.fsu.edu/admissions/graduate-admissions/check-admission-status/"}}