{"content": "Interdisciplinary Master’s Degree in Data Science (MS-IDS) in Computer Science | Interdisciplinary Master’s Degree in Data Science (MS-IDS) in Computer Science Program Overview The Florida State University (FSU) College of Arts and Sciences and the Departments of Computer Science, Mathematics, Scientific Computing, and Statistics offer a Master’s of Science Degree in Interdisciplinary Data Science (MS-IDS) that provides students a unique and broad educational experience across the four foundational areas of Data Science. The program requires 30 credits and can be completed in three academic semesters. The program consists of – a common core of 18-credit course work, and four additional electives that define a concentration in one of the participating areas Admission Requirements The MS-IDS graduate program appeals directly to students with undergraduate degrees in math, computer science, or statistics, but will also attract students with less traditional backgrounds, e.g., physics or engineering.  Therefore, the admissions requirements are designed to select students with strong training in mathematics, statistics, and computer science that would be common across a range of undergraduate degrees. In addition to meeting all of the University and College admission requirements for graduate study, each applicant for the MS-IDS program must: –> The FSU IDS program is a self-pay program. In addition to meeting Florida State University and College of Arts and Sciences admission requirements for graduate study, each applicant for the FSU IDS program must: Have earned a Bachelor’s degree from an accredited institution and possess a minimal background consisting of Calculus 2 (MAC 2312 or equivalent), Introductory Statistics (STA 2023 or equivalent), and experience with an object-oriented programming language, preferably Python or R. Coursework in linear algebra is desirable, but not mandatory; Have a minimum of 3.0 GPA (B or better average) on the last 60 hours of undergraduate credits; and be in good standing at the institution of higher learning last attended; Provide a statement of intent and CV or résumé; and Provide three letters of recommendation discussing the student’s aptitude for graduate study A GRE score is not required for admission to the FSU IDS program for Fall 2021. Different majors and advanced electives may require additional prerequisites, which students will either have to demonstrate in their backgrounds or take additional coursework to satisfy. Additional information is available on the MS-IDS web site . Graduation Requirements The program requires at least 30 credits and 16 months to complete a course-based degree (3 academic semesters). The curriculum is designed with the expectation that the majority of students will graduate with a non-thesis course-based master’s degree. All students will complete a common set of core courses (18 credits) and a minimum of 12 credits of electives that define the specific chosen major. Although most students are expected to complete the course-based option, students will have the option to pursue completion of a thesis or project track by completing a qualified research project, taking additional credits for research and project/thesis defense. This track may require up to 6 additional credit hours. Interdisciplinary Data Science Core Coursework: This is a course-based Master’s degree program. All students will complete 30 credit hours consisting of 18 hours of core courses and 12 additional hours of coursework that define a specific major. 18 hours of core courses consist of: MAD 5XXX Mathematics for Data Science (3) COP 5XXX Introduction to Data Science (3) STA 5207 Applied Regression Methods (3) STA 5635 Machine Learning (3) CAP 5771 Data Mining (3) PHI 5XXX Data Ethics (2) XXX 5XXX Professional Development Seminar (1) Required Electives: The 12-hour additional coursework consists of four graduate courses and they are major-specific. For MS-IDS in Computer Science , the additional four courses are: CAP 5XXX Advanced Topics in Data Science (3) COP 5XXX Advanced Data Mining (3) Restricted Electives: One course in Cybersecurity chosen from the following, based on student background: CGS 5XXX Computer Security Fundamentals for Data Science (3) CIS 5370 Computer Security (3) One course from the following: CAP 5619 Deep and Reinforcement Learning Fundamentals (3) CAP 5605 Artificial Intelligence (3) CDA 5125 Parallel and Distributed Systems (3) CDA 5155 Computer Architectures (3) CNT 5505 Computer and Network Administration (3) COP 5570 Concurrent, Parallel and Distributed Programming (3) COP 5611 Advanced Operating Systems (3) COP 5725 Database Systems (3) COT 5405 Advanced Algorithms (3) ISC 5318 High-Performance Computing (3) Free Electives: None Detailed course description is available on the here .", "meta": {"url": "www.cs.fsu.edu/datascience/"}}