{"content": "Departmental Committees: Charges | Departmental Committees: Charges Departmental Committees Every committee is expected to have a written description of its duties and responsibilities, as well as summary minutes of meetings and actions; all committee actions are considered to be recommendations to the department except for the FEC. The FEC has specific powers delegated to it. It is the responsibility of the committee chair to keep committee charge, process, and activity minutes up to date. These records should be in electronic form and available on-line to the department. The committees were all charged in 1991 with writing their basic responsibility and process documents. These should also be on line. Current committee chairs should obtain documents from previous chairs and update them as appropriate. Current assignments of individuals to committees and other special responsibilities are given on a separate page. Elected Committees The following committees are charted by the department’s Bylaws and elected by the faculty. Faculty Evaluation Committee (FEC) This committee is elected each year, according to the procedures defined in the Bylaws of the department. The department chair is not eligible. Its responsibilities include faculty development and mentorship, doing annual evaluations of department faculty , recommending doctoral directive status, recommending merit salary increases, and making nominations for faculty awards. FEC should elect its own chair immediately, after consulting approved FEC procedures . FEC chair should watch out for deadlines for nominations for various awards, and is responsible for completing annual evaluations before Spring Break. Chair Search Committee (CSC) The departmental Bylaws state: “Every three years, a four member Chairperson Selection Committee shall be elected. This election is to take place early in the fall semester and the election procedures are to be the same as for the Faculty Evaluation Committee. (See the FEC Procedures document for more detail.) This committee will recommend its choice of chairperson to the faculty. It is permitted that this choice be the incumbent. The committee’s recommendation will be presented to the faculty for its ratification. A vote of two-thirds majority of the voting membership is required for ratification. When a recommendation is ratified, it will be forwarded to the Dean of the College.” When the dean permits, this committee is further responsible for recruiting outside candidates for department chair. Note: The above description from the Bylaws of the department is inconsistent with the facts of FSU administration. Department chairs are appointed and serve entirely at the will of the dean, not the faculty. Our deans have tried to respect the intent of the department’s Bylaws, to involve the faculty in department chair choices. Most recently the dean has insisted on including an outside member, and on having the committee recommend a short list of choices rather than a single individual. Appointed Committees The following committees are charted, and the members appointed, by the department chair. Undergraduate Curriculum Committee (UGCurr) This committee is responsible for oversight of the undergraduate curriculum, including new course proposals, modifications to existing courses, approval of textbook choices for all undergraduate courses, and new undergraduate degree and certificate programs. Graduate Curriculum Committee (GCurr) This committee is responsible for oversight of the graduate curriculum, including new course proposals, modifications to existing courses and degree program requirements, and new graduate degree and certificate programs. PhD Portfolio Review Committee (PhDPort) This committee is responsible for reviewing annually the progress of all Ph.D. students. The committee consists of a core that is appointed by the Department Chair, together with any other Department faculty with doctoral directive status who elect to participate. Meetings of the committee should be announced to all CS faculty. After each annual evaluation, the Portfolio Evaluation Committee will recommend whether the student should continue in the program. The duties are further described in the FSU Graduate Bulletin and are viewable on-line . Graduate Student Recruiting Committee (GradRec) This committee is responsible for recruiting graduate students, and generally working to continually improve the caliber and numbers of our graduate student population. This committee will have an expense budget, which can be used at the discretion of the committee, e.g. , to invite candidates to visit our campus. The committee is expected to take initiative and exercise creativity in accomplishing its mission. Financial Aid & Admissions Committee (Adm/Aid) This committee is responsible for evaluating applications for graduate admission and financial aid. This committee coordinates closely with the Graduate Student Recruiting Committee. Faculty Recruiting Committee (FacRec ) This committee is responsible for recruiting faculty. Responsibilities include actively seeking strong faculty candidates, reviewing and ranking applications, selecting candidates for interview, and hosting the visits of candidates. This committee will have an expense budget. Equipment & Network Infrastructure Committee (Equip) This committee is responsible for gathering, archiving, and publicizing existing policy and recommending new or revised policy to the department in the area of computing infrastructure. Computing infrastructure includes the computing network, servers, and workstations, in offices, classrooms, teaching laboratories, and research laboratories, and the supporting staff and budget resources. Appropriate areas of policy include privacy, security, licensing, accessibility, usage, allocation of existing resources, and priority-setting for acquisition of new resources. The committee will solicit input from all appropriate sources, including the system group, the faculty, the curriculum committee, and various student groups. The department’s system and network administrator is a voting member of the committee, by virtue of office. The chair and other members are appointed by the department chair. When requested by the department chair, the system administrator will prepare specific proposals for infrastructure purchase and deployment. The committee will review these proposals to make sure the proposals are in alignment with and support of policies of the department. Once refined and agreed to by both the system administrator and the committee, the recommendations will be submitted to the department chair. Software Engineering Oversight Committee (SE) This committee is responsible for deciding admissions to the Software Engineering Master’s track, periodically reviewing the progress of students in the track, periodically reviewing the curriculum for the SE major, and generally overseeing the operation of that major. It generally meets once a semester. In recent years, for simplicity and convenience, it has had the same members and chair as the CNSA Track Oversight Committee. For more information on the responsibilities of this committee see the CNSA track web pages . CNSA Oversight Committee (CNSA) This committee is responsible for deciding admissions to the Computer and Network System Administration Master’s track, periodically reviewing the progress of students in the track, periodically reviewing the curriculum for the CNSA major, and generally overseeing the operation of that major. It generally meets once a semester. In recent years, for simplicity and convenience, it has had the same members and chair as the SE Track Oversight Committee. For more information on the responsibilities of this committee see the SE track web pages . Information Security Oversight Committee (InfoSec) This committee is responsible for development of the department’s initiative in Trusted Systems, the development of courses in information security, the Information Security Professional Certificate, the Security teaching and research laboratories, and the proposed new institute and and degree program (or major) in information security. It is also responsible for assisting the Faculty Recruiting Committee and the Graduate Recruiting Committee in recruiting faculty and students in the area of Information Security. Newsletter Editor (News) This committee is responsible for seeing that the department sends out a high quality newsletter, suitable for mailing to faculty and graduate students at other universities. The goal of the newsletter is to make our department and its strengths better known across the country. This project will be assigned a budget, and coordinate with the Graduate Student Recruitment Committee.", "meta": {"url": "www.cs.fsu.edu/department/resources/committees/"}}