{"content": "Summer Teaching Policy | Summer Teaching Policy Who is Paid to Teach in the Summer? The department typically is allocated a very small budget for summer faculty salaries. This allows the department to hire a few 9-month faculty members to teach courses during the summer. The amount allocated to the department is typically enough to cover about three courses. Faculty paid from this budget only for instruction, not for research. According to the Collective Bargaining Agreement, the total amount paid for a faculty member to teach a given course in the summer must be the same as the amount paid for teaching the same course during the academic year. This means that a course that would normally be a 25% duty assignment in the academic year is a 37.5% duty assignment if for the A term, and a 76.2% duty assignment if for the B or C term. The policy of the department is that before the schedule of classes is made for a given summer the Department Chair polls the faculty (by paper memo or e-mail) to find out: Who would like to teach a regular course for the summer, and what courses they are willing to teach?The department is normally interested only funding 9-month faculty to teach graduate courses. Non-tenure-track faculty, who are on 12-month appointments and so required to teach summers, generally cover the undergraduate courses, along with teaching assistants and adjuncts. Only graduate faculty members may teach graduate courses, and most graduate faculty are 9-month faculty. The Department Chair chooses from those responding to this question a few (generally two or three, depending on budget) faculty members to teach graduate courses for the summer. If the budget is insufficient to satisfy all requests for summer teaching, priority is given to those who have not been paid to teach a regular summer course recently, based on a round-robin list. Whenever a person teaches a regular summer course that person is placed at the tail of the list, so those who have not taught recently are ahead in the line for summer teaching of those who have been paid to teach a regular summer course recently. Since anyone can remember, the number of requests has always been less than or equal to the number that could be funded, so no such prioritization has been necessary. Who plans to supervise graduate students on DIS, supervised research, thesis, or dissertation during the summer, and who are the students they plan to supervise?The Department Chair funds as many of these faculty members as possible, each for a small FTE, to allow them to be instructor of record for individual instruction courses for the summer without violating the policy of the Dean of the Faculties described further below. The amount of the appointment is symbolic, and varies according to the number of faculty interested and the amount of funds available. It is typically just a few percent. As with all instructional appointments, faculty on such appointments are expected to be mostly in town during the period they are appointed, so that they are available to supervise the students in their individual instruction courses. Who is Allowed to Sign as Instructor of Record for Individual Instruction Courses? There is a policy (due to the Dean of the Faculties) that only individuals who have an instructional appointment ( i.e. , are on the payroll for the summer with a non-zero percentage of instructional assignment) may be listed as instructor of record for a course. The occasion when some faculty members run afoul of this policy is when they have students who are working on a thesis or dissertation during the summer, and what to sign up for thesis or dissertation hours, but the faculty member cannot be instructor or record because the faculty member is not on the department’s teaching payroll for the summer. The department’s summer teaching allocation policy (see above) is intended to solve this problem primarily by giving a small percent FTE summer appointment to each faculty member who expects to have individual study students enrolled for the summer. The one exception to the policy is that a faculty member who is on FSU’s payroll to do sponsored research may sign as instructor of record for (only) DIS, supervised research, thesis, or dissertation if the student is getting credit for doing work on the sponsored research project (whether or not the student is paid for the work). Whether on a grant or an instructional appointment, the appointment period of the instructor of record for a course must cover the full term during which the student is registered. Where a student needs to register for thesis or dissertation and the regular thesis or dissertation advisor is not eligible to be instructor of record, it is recommended that the instructor of record be another member of the student’s supervisory committee, or the department chair. Note that there is a clear principle behind this policy, which every faculty member would support, i.e. that we do not teach for free. This principle is one that is important to maintain, lest some day we be required to teach in the summers without any additional compensation. Copyright © 2015 Florida State University Computer Science Department", "meta": {"url": "www.cs.fsu.edu/department/resources/summer-teaching-policy/"}}