{"content": "Teaching Assistants | Teaching Assistants Teaching Handbook Table of Contents Introduction Relationship of Teaching Assistant to Faculty Supervisor Program for Instructional Excellence Conferences Office Hours SUSSAI (Teaching Evaluation Forms) Videotaping Supervisor Evaluation of Teaching Assistants Teaching Assistant Ranks & Responsibilities Resources for Teaching Assistants Problems that TAs Encounter Syllabus Introduction Teaching computer science at FSU is a challenging yet rewarding experience. Graduate teaching assistants are given a wide variety of responsibilities and duties in their assistantships. This handbook will attempt to introduce the new TA to the computer science department as well as to provide the experienced TA with a set of resources to aid in teaching classes at FSU. Relationship of Teaching Assistant to Faculty Supervisor Every teaching assistant is assigned a supervisor. In the case of TA’s who are grading, teaching recitation sections, or serving as mentor for a distance learning section, that supervisor will be the lead instructor for the course. If the course has only one lecture, the lead instructor will be the lecturer for that course. If the course has multiple lectures, one of the lecturers is designated as the lead instructor for the entire course. The relationship between TA and supervisor depends on the whether the TA is is a grader, a recitation instructor, or a full-responsibility classroom teacher. Grader: Supervisor writes course syllabus and sets grading policies. Supervisor schedules TA office hours, to coordinate with other sections of the same course and to fit the available office hour space time slots. Supervisor introduces TA to class, and includes TA contact info. on syllabus. Supervisor plans the assignments, perhaps in collaboration with the TA. Supervisor goes over answers and grading scheme with the TA prior to grading. Supervisor spot-checks TA grading results. Supervisor checks that TA keeps reasonable office hours, and gets work back to students in a timely fashion. Supervisor may ask TA to attend lectures and take attendance at lectures. Supervisor calculates and assigns final grade. TA grades work, and submits it to supervisor (sorted by grade). TA assists supervisor in proctoring examinations Recitation Instructor: TA is responsible for all of the items for Grader. In addition, the following apply: Supervisor discusses a lesson plan for each recitation meeting with the TA. Supervisor attends and critiques some sample of the recitation sections, say at least 1/4 of them. Supervisor checks that TA arrives on time for all recitation meetings. TA is required to attend all lectures given by the Supervisor. Recitation instructors should approach their supervising instructor, before the start of the term, to inquire about the instructor’s wishes as to the content and form of the recitation. The department does not expect any recitation to consist of simple question and answer sessions, and under no circumstances should the TA decide to cancel a recitation or allow the students to leave early because the TA has “nothing to do”. Unless the Supervisor specifically commands otherwise, all TAs should prepare a semi-formal presentation emphasizing the difficult and/or important points covered in recent lectures. The format can be quite varied, of course (whatever works); e.g. problems to go over, having the students write collective code, re-stating concepts etc. If you feel you are not getting appropriate guidance from the supervising instructor, please approach the instructor first, then come and see the Associate Chair. On the first meeting of each class, both the supervising instructor (or lecturer, if the course has multiple lecturers) and the TA should be present to be introduced to the class. Full-Responsibility Classroom Teacher: TA is responsible for all of the items for Recitation Instructor. In addition, the following apply: TA writes syllabus, prior to start of each term, and seeks approval from supervisor. TA writes all homework assignments and examinations, and submits them to supervisor for approval, prior to giving them to the class. TA calculates and assigns final grades, and submits them to supervisor for review and approval. Supervisor reviews syllabus with TA prior to start of term. Supervisor meets with class once at the start of the term, to be introduced by the TA as the person to whom students should address any disputes with the TA. Supervisor reviews and approves all homework assignments and examinations, before they are given. Supervisor attends and critiques at least one class meeting. For the relationship between the faculty supervisor and the teaching assistant to be most effective, discussions concerning the course should begin several weeks before the beginning of the semester. (Remember: TA’s and faculty are on the payroll for at least two weeks prior to the start of every term, and are expected to use that time for class preparation and organization.) The discussion of the course should include the syllabus, the policies of the course, how students will be evaluated, etc.. Since faculty members are typically very busy, the responsibility for initiating the discussion will fall on the shoulders of the TA. As a TA gains more experience teaching a given course and establishes a working relationship with a given faculty supervisor, the supervisory relationship may be “loosened”, at the discretion of the faculty supervisor. However, ?he TA should be prepared to accept closer supervision and direction if assigned to a new course and/or supervisor. Program for Instructional Excellence Conferences Teaching assistants are required to attend one of the Program for Instructional Excellence teaching conferences each year. PIE attempts to offer workshops that will benefit both the new and the returning TA. These conferences are held in the Fall and the Spring semesters, a few days before the beginning of each semester. For more information regarding these conferences, contact the Program for Instructional Excellence , 408 Westcott, 644-8844. Office Hours All teaching assistants must set up office hours and be available during those hours for student meetings. Typically, for every hour spent in the classroom, the TA will have one office hour. Therefore, if the TA teaches a three credit hour class, she will schedule three hours in her office during the week. It is best to stagger these times somewhat to allow students with varying schedules to be able to drop by. If there are students who have conflicts with the scheduled hours, the TA should be flexible in setting up alternative meeting times. Failure to hold office hours, or failure to show up is a very serious matter. Normally, the department provides individual desks for TA’s, in shared offices, in convenient locations. However, we cannot always do that. Recently, the entire university population has been growing faster than new buildings are being constructed, so we find ourselves very cramped for space. Therefore, for Fall term 2001, most TA’s (especially graders) will be required to share a desk with another TA, and nearly all will have their offices in a bullpen area. In such cases, since conversations in a shared area would be disturbing to other occupants of the office, TAs are encouraged to hold office hours in one of the department’s teaching labs or other space set up by the department for office hours. To find out what shared spaces are available for holding office hours in any given semester, ask your faculty supervisor, the Laboratory Manager, the Associate Chair, or the Department Chair. For courses with multiple sections, the supervising instructor of the course (there is only one per course) is responsible for assigning office hours to TA’s so that the hours of different TA’s do not overlap. For such courses, all TA’s will hold offices hours in a single place, designated by the supervising instructor. All TA’s will be responsible for answering questions of students from any section of the course. SUSSAI Any TA who spends time in the classroom is required to administer the SUSSAI (student evaluation of teaching) forms EVERY semester that they teach. For courses with different people doing the lectures and recitations, the forms must be administered separately, for both recitations and lecturers. Videotaping TA’s who spend time in the classroom are required to be videotaped. Arrangements can be made through the department’s Teaching Associate. Once videotaped, the TA may request that the Teaching Associate, someone from PIE or someone else from the department view the videotape and make constructive suggestions concerning improvements that may be made. Supervisor Evaluation of Teaching Assistants Each teaching assistant will be observed in the classroom environment by the faculty member supervising the course. The faculty supervisor will fill out an evaluation form and should discuss that form with the TA after the observation. In addition, all TAs with classroom responsibility are required to administer SUSSAI for every semester of teaching. The SIRS forms are not returned to the TA until the following semester and will be examined by the Associate Chair of the department at that time. The Associate Chair is available for discussion of SUSSAI forms. Because these forms are not returned until after the end of the semester, they are of little use in correcting problems the TA may be currently experiencing. The Program for Instructional Excellence offers Teaching Analysis By Students (TABS), which are similar to SUSSAI, but are administered at midterm and returned within a week. To find out more about TABS, contact the Teaching Associate or PIE (644-8844). The department uses the faculty supervisor evaluation forms and SUSSAI to select recipients of the Departmental Outstanding Teaching Assistant Awards. Students who meet all of the following requirements are eligible: Must be in good standing with the University; Must be currently enrolled and actively pursuing a graduate degree in computer science at FSU; Must have had full classroom teaching responsibility for a class offered by the computer science department in the previous spring and/or fall semester. The TA evaluation committee (comprised of department faculty) will form a ranking of the eligible TAs by composite SIRS from the previous spring and fall, use supervisor evaluation forms to confirm the ranking formed above, seeking additional supervisor input as needed, present the rankings with supporting data to the TA evaluation committee for discussion and approval, and choose the top candidate(s) from this ranking for Outstanding Teaching Awards. At least one award is to be given each year, and up to 25% of the eligible TA’s in a given year may be chosen for awards. Note that those who have graduated or left the University since the teaching was performed are not eligible for awards. TAs may receive multiple Departmental Outstanding Teaching Assistant awards throughout their tenure at FSU. There is no distinction among new TAs, TAs with longer teaching records, Masters students or PhD students. Therefore, all eligible TAs compete as equals for the awards. The University also presents a number of Outstanding Teaching Assistant awards each year, through the Program for Instructional Excellence. The TAs must be nominated by either their students or members of their departments. They are then asked to fill out an award application and submit letters of recommendation from their peers, students and graduate professors as well as sample SIRS forms and a copy of a syllabus. Nominees’ applications are rated on how well the TAs organize their subject matter, how available and accessible they are to their students and if there is evidence that they show respect for their students regardless of race, religion, and sex. A TA may receive only one University-wide Outstanding Teaching Assistant award in his or her tenure at FSU. Teaching Assistant Ranks & Responsibilities Teaching assistants in computer science may receive appointments which require a variety of tasks. A TA may be a lead TA, that is, assigned primary classroom responsibility for a particular course. The TA may be assigned to teach the recitation sections of a programming class. Finally, a TA may be assigned grading duties under the guidance of a faculty member. TA’s assigned to grading duty are typically required to also monitor one of the undergraduate computer labs in the department. The standard appointment for an assistantship is twenty hours per week, although at times, TA’s may be asked to do more than this. If the TA is a lead TA, twenty hours per week translates to two three-hour classes (usually 2 sections of the same class). Job descriptions for each level of assistantship along with the compensation for that level is listed below. Three-tier Assistantship Model The department currently has a graduated scale where pay amount is based on experience, level of responsibility, and other factors. The three main classifications of graduate stude?t assistants are described below. 1. Lead TA – Full Responsibility Classroom Teacher Qualifications: At least 18 hours graduate work and preferably a M.S. degree in CS. One year of teaching experience in CS. Responsibilities: Full classroom responsibility, supervised by Department Chair or Associate Chair (typically two sections of the same 3-hr course), or senior system administrator (must have two years system manager experience). 2. TA – Recitation Instructor Qualifications: Degree in CS or another field with at least 18 hrs in CS at the junior or senior level. Responsibilities: One of the following: two 2-hr recitation sections of same course, including grading for that course, plus supplemental grading or lab hours (5 hrs/week). High level of faculty supervision. two 1-hr recitation sections of same course (including grading) plus supplemental lab hours (8 hrs/week). High level of faculty supervision. system administrator Departmental project assignment, supervised by Associate Chair 3. Graduate Assistant – Grader Qualifications: Bachelor’s degree in some field with at least 12 hrs in CS at the junior or senior level. Responsibilities: Twenty hrs per week of grading/lab work, where a grading assignment for a course counts as 5 hrs/week. Since there are only a certain number of slots of each category available, it is possible that a person qualified for a lead TA or a TA position may be offered a lower position. If this is the case, the compensation and the duty assignment would correspond to that lower position. If a person is in a TA position and is asked to perform lead-TA duties, pay will be given at the higher rate for that term with no implication that the student will stay at the higher rate permanently. In continuing years, students will be considered for upward moves in the 3-tier plan without any formal application process. Evaluations by the Chair, the Associate Chair, and the TA Evaluation Committee will play a significant role. If there are no recitation sections available for a TA, the student will be given the option of taking pay at the lower level and performing grad assist duties, or the student may elect to provide additional service to maintain the higher rate of pay. Examples would be as follows: 20 hrs/lab plus one grading, or 13 hrs/lab plus two gradings Occasional special assignments may require adjustments in assignments and pay, but a student will never be forced to take less pay than was originally offered by the assistantship. Resources for Teaching Assistants Copying The department has a variety of equipment and other resources available for use by teaching assistants. At the beginning of each semester, TA’s with classroom responsibility will receive a course id number that may be used on the copy machine located in the computer science office. All copies to be made for a class can be done using this id and will be charged to that particular course. This copier id can also be used to print materials on the various laser printers around the department so that the TA’s personal page count (200 pages per semester) is not exhausted by materials for the course. Overheads There are several overhead projectors that can be reserved for use in the classroom. There is a reservation sign-up sheet inside the department administrative office suite, 203 Love. One can also get blank overhead slides that will work in the photocopy machine from the office staff for preparing your lectures. The department also has cart-mounted portable computer and projection machine available for use in order to do application demonstrations in classes that do not have such equipment built in. These materials can?be reserved by contacting the Systems Group (system@cs.fsu.edu). Videos Many of the classes that are taught by teaching assistants may benefit from the showing of videotapes on a wide variety of topics. For example, the department has the PBS series “The Machine that Changed the World” available on videotape. To reserve a tape (or to peruse the list of tapes available), see Jennifer Reed in 203 Love. Syllabi of Previous Classes The department maintains a book of syllabi prepared for classes in the past. Teaching assistants are invited to look at these to get ideas about what the department expects in a syllabus and also to get ideas about what is to be covered in a particular course. See Martha Snyder to take a look at past syllabi. It should be noted at this point that all syllabi for the department are required to contain a statement announcing that reasonable accommodations can be made for students with disabilities and particular needs. If you have questions about this statement, see the Teaching Associate or Associate Chair. CS Department Web Site The department maintains much information online at http://www.cs.fsu.edu/ . Lists of faculty and their office hours, software and hardware available on the department system as well as information about funding, jobs and fellowships can be accessed on the web site. Books on Teaching The Program for Instructional Excellence has a large library of books and other materials concerning all aspects of teaching. These books are available for borrowing to all teaching assistants. To find out more about these materials, contact the Departmental Teaching Associate. In addition, the department has some materials available for perusal. To see these, contact Jennifer Reed in 207 Love. Evaluation Services Teachers can administer bubble sheets for testing and have them graded by Evaluation Services in the Johnson Building. This service allows analysis of individual questions according to the number of students who got the question right or wrong and how well they did on the rest of the test. In addition, Evaluation Services provides a free electronic gradebook program. One can receive a copy of this program by simply bringing a disk to Evaluation Services to put the copy on. If the teacher then decides to use the bubble sheet testing, student grades can be recorded on disk by Evaluation Services and then loaded directly into the electronic gradebook. Workshops The department maintains a close relationship with the Program for Instructional Excellence. PIE offers a variety of workshops concerning various aspects of teaching at FSU. These workshops include those offered at the University-wide Fall and Spring Teaching Conferences as well as others offered throughout the year. Topics in the past have included: Active Learning, Retaining Minority Students in the Sciences, and Writing to Learn. TAs in the computer science department are required to attend one of the two teaching conferences each year and are strongly encouraged to attend the other teaching workshops. Teaching Associate In conjunction with PIE, the department may have a Teaching Associate available for consultation with TAs. The Teaching Associate provides a wide variety of services including videotaping, office hours for discussion of teaching issues, organization of the peer observation program and planning meetings to discuss various aspects of teaching within the department. For more information about becoming a Teaching Associate contact the Associate Chair. Problems That TAs Encounter Teaching assistants in every department will encounter some difficulties during the course of their duties. Some of difficulties will be unique to the department while others are fairly universal. The list of potential problems presented b?low is by no means a comprehensive list but attempts to prompt the TA to think about some problems and how to deal with them before the problems arise. Cheating Cheating is an uncommon but extremely difficult problem. In computer science, it can be especially difficult to deal with on program assignments. It is relatively easy for someone to simply copy another student’s program, change a few variable names and pass the program in as one’s own. If the program works correctly, this is extremely difficult to detect. It is even more difficult to detect cases where a student has a friend or hired tutor work on the program. If you think you have detected a case of similar-looking programs you should ask the student to meet with you. If this is your first time dealing with cheating, you may want to first seek advice from the Associate Chair or Department Chair. You should explain the situation and ask the student to explain why the two programs are so similar. Many times, the problem is simply one of misunderstanding. Students do not realize that working so closely on the program is cheating whereas discussing ideas and approaches to solutions is encouraged. It will be up to your judgement to determine whether to treat the infraction as a formal case of cheating or to just give the student a warning. In any case where cheating is suspected, you should always preserve all the evidence, in case the case needs to be treated as a formal honor code violation or in case the student ignores a warning and continues the behavior. Cheating on homework, including programming assignments, is sometimes hard to to detect. However, it will generally result in the student not achieving the learning objectives of the assignment. Examinations should be written in a way that if undetected cheating on programs does occur on an out-of-class assignment, and the learning objectives of the assignment are not met, the student will not pass the examination. Further, it is a departmental policy for courses involving programming assignments or other out-of-class work that are taught by TA’s that the final course grade cannot be higher than “D+” unless the supervised (examinations and supervised in-class exercises) grade average is “C-” or higher. The course syllabus should state this clearly. The department’s formal policy for dealing with any type of cheating when it is detected is to ask the student to sign a letter acknowledging that she or he has violated the academic honor code, accepting a specified academic penalty, and accepting the warning that any further violation for this course will result in a specific academic penalty. A typical academic penalty for a clear case of intentional cheating is reduction of one letter grade for the course. The principle to keep in mind in deciding on a penalty is that it must be severe enough to serve as a disincentive for cheating. Thus, for example, if a student’s grade would have been “F” anyway, it would be no penalty at all if you just assign a final grade of “F”; instead you may stipulate that the student also is not to retake the course with the grade forgiveness option. If the student signs the letter, it should be delivered to the Associate Chair or Department Chair. If a student is not willing to accept the academic penalty, the case should be sent up to the Associate Chair or Department Chair to start formal proceedings. If one student comes to the teaching assistant to accuse another student of cheating, the accusing student must be made aware that in order for any action to be taken on the accusation, that student must be willing to have his or her name known to the accused student. Without this acknowledgement, the department and the University have no choice but to drop the matter, unless the instructor is able to find other, independent, evidence of the cheating. Finally, you should stress the department’s resolve?to come down very hard on cheating and your own resolve to check for cheating, on the first day of class and whenever thereafter you feel is appropriate. Cases of cheating must be brought to either the Chair or Associate Chair of the department, and you should tell your students that even if the TA chooses to simply give a 0, for example, the department may on its own institute formal proceedings. Examinations for Students with Disabilities The only condition under which students will be allowed to take examinations in the SDRC (Student Disability Resource Center) for courses given by this department is if there is an employee of the department (faculty, TA, or staff) present to proctor the exam. It will be the responsibility of the student to arrange a time that is convenient for the instructor for the student to take the exam. Drop & Add Period The Department has a policy of dropping students who did not attend the first class of a term. At the first meeting of the term you should take roll, compare the roll against the official class roster (obtainable on the department’s computer system) and pass on to the Academic Coordinator a list of the students who did not attend the first class. During the drop/add period (the first four days of the semester), many students will beg, plead, cajole, do whatever they can to get into some of the classes taught by the computer science department. If the course has a cap on the number of students, the teaching assistant has final say as to whether to raise that cap. TAs should bear in mind that some caps cannot be raised because there are fire code limits on the number of people allowed in certain classrooms. Other caps are in place because a course will be partially taught in one of the computer labs and there are a limited number of PCs in these labs. These caps may be raised at the discretion of the TA but bear in mind that, for example, although there are a given number of PCs in each literacy lab, at any given time, several of them are not working. Raising the cap of a computer literacy class beyond the number of PCs in the lab, then, will make the class difficult for all involved. Probably the easiest way to deal with students attempting to add a class is to take a list of names on the first day of class, allowing students to mention any extenuating circumstances (graduating senior, etc.). Instruct the students to then check with the Academic Coordinator of the department about trying to get into the class. Give the list to the Academic Coordinator and advise her if there are students on the list that you think should definitely be in the class if there are openings. After those students are allowed into the class, the rest of the openings should be filled on a first come, first served basis (that is, first to come to the Academic Coordinator). Syllabus The syllabus is the most important piece of paper(s) the TA will hand out all semester. It represents a contract between the students and the TA. As a result, the syllabus should contain as much information about the course as possible. All policies for the course should be explicitly stated in the syllabus including how students will be evaluated. A list of textbooks and other materials needed for the course should be included. The TA should include his/her office hours on the syllabus as well as a phone number where she/he can be contacted. In the computer science department, it is useful to also include an e-mail address. Important dates, such as for the midterm and final examinations, should be listed. In short, if the syllabus is a good one, it will head off many potential problems by laying the rules out for?everyone to see at the beginning of the semester. It is also a good idea to verbally highlight the important points on the first or second day of class. Information that is communicated in two ways is more likely to be retained than if it is communicated in only one way. Each teaching assistant is required to have her/his syllabus reviewed by his/her supervisor, and then file two copies of his or her syllabus with the Academic Coordinator (as of last editing, this is Jennifer Clark) in the computer science office prior to the start of classes each semester. These syllabi will be available for review in future semesters by other TA’s teaching the same course. There are several specific items that must be included in the syllabus, including the following: instructor’s name, office location, telephone number, e-mail address, and office hours the textbook(s) and any other required reference materials: The choice of textbook must be approved by the departmental curriculum committee. If a TA believes the textbook for a course should be changed, the TA should bring the matter up with the Associate Chair or Department Chair. dates of examinations, include the final examination: It is a departmental policy that final examinations are required in all undergraduate courses. It is university policy that final examinations shall be given only during the final examination time specified for the course in the Schedule of Classes. Note that this rules out “take home” final examinations. summary or outline of the educational objectives and topics to be covered by the course: Two different things are required. The objectives are different from topics. Objectives are stated in terms of what the student should be able to do to pass the course. For example, “recognize, define, and correctly use, the terminology of operating systems” and “apply commonly used synchronization primitives to write correct multithreaded systems” might be objectives of an OS course, and and “design, code, document, test, and debug an Internet application program written in Java” might be an objective for a course in Java programming. In contrast, topics are more like the titles of lectures or textbook chapters. For example, “virtual and hierarchical memory”, “process scheduling”, and “synchronization primitives” might be topics in an OS course. statement of attendance policy: The FSU General Bulletin says: “ Students are expected to attend all of their scheduled University classes . The University reserves the right to deal at any time with individual cases of nonattendance. The effect of absences upon grades is determined by the instructor. Arranging to make up work missed because of legitimate class absence is the responsibility of the student. A student reported for excessive absence in any course may be required by the academic dean to drop the course with the grade of “F”. Students reported absent for a period of two weeks or more may be readmitted only by permission of their academic dean. Upon readmission the dean may require a reduction of the academic load.” The Faculty Handbook amplifies this policy: “ The faculty member is expected to check attendance in all classes . The faculty member is expected to make some allowance for absence occasioned by illness, by trips for the University, or by authorized field trips. Any arrangement to make up work because of class absence is the responsibility of the student. The effect of absence upon grades is determined by the instructor; at the beginning of the term the faculty member explains the grading policy to the students. Class attendance for student athletes will be monitored by BOR rule and verified to the Registrar’s Office.” For lower level courses it may be especially beneficial to base a portion of the grade — as much as 10% — on attendance, ? so as to discourage students from skipping class. statement of grading policy: This should be consistent with the departmental policy about out-of-class work not making the difference between a passing (C- or better) and failing (D+ or lower) grade. statement on accommodation for disabilities: This should be the standard “boiler plate” provided by the department, which as of the last editing of this handbook was as follows:Students with disabilities needing academic accommodations should: Register with and provide documentation to the Student Disability Resource Center (SDRC). Bring a letter to the instructor from the SDRC `indicating you need academic accommodations. This should be done within the first week of class. This syllabus and other class materials are available in alternative format upon request. For more information about services available to FSU students with disabilities, contact the Assistant Dean of Students: Student Disability Resource Center 08 Kellum Hall Florida State University Tallahassee, FL 32306-4066 e-mail: sdrc@admin.fsu.edu phone: (850) 644-9566. statement on honor code violations and penalties: This should be consistent with the Student Handbook and departmental policies. For example, the following text is acceptable:As in any class at F.S.U., it is your responsibility to read, understand, and conform to the Academic Honor Code as set forth in the University General Bulletin and the Student Handbook. Any violation of these policies, especially involving plagiarism or the giving or receiving of help on any assignment, will result in severe penalties. Penalties include a grade of F with no provision for retaking the course under the forgiveness policy, and proceedings before the honor court.By turning in work for a grade in this course you are representing it as being entirely your own individual work. Unless otherwise specified in writing, all homework and programming projects are individual work. If any assignment permits teamwork, it will be explicitly stated so in the assignment, and then the work is required to be only the work of the people on the team.What does “individual work” mean? An intelligent person searches publications (including the web) for information, ideas, and code. If you use information or ideas obtained from the work of another person you must at least give credit via comments in your code stating what you have used, where you obtained it, and who is the person to whom credit is due. If you use any code written by another person you must first obtain permission from the author or copyright owner, then mark the beginning and end of the quoted code using appropriate comments, and include a comment giving where you found the code and the the name of the author or copyright holder. Failure to follow these rules will be considered a violation of the Academic Honor Code. Every test, quiz, computer program or other project turned in by a student must include the following affidavit (this is to forcefully remind each student of the policy). Modify it as shown for tests/programs.I hereby attest that I have neither given or received any assistance (in the completion of this project, or during this test). I fully understand that with regard to any work done at this university, the violation of this policy can result in a zero on the (project, or test), an F in the course, and possible expulsion from the university. _________________________ Signature? statement on classroom decorum: Include a statement about behavior in the classroom. In particular, emphasize that disruptions are cause for expulsion from the classroom.Side conversations, cell phone use, and other disruptive or distracting behavior are not permitted in the classroom. Violators may be expelled from the room, and repeat violators may be expelled permanently. If this is your first time writing a syllabus, check with your faculty supervisor for assistance.", "meta": {"url": "www.cs.fsu.edu/department/resources/teachinghandbook/"}}