{"content": "Recruiting Chair and Host Duties and Responsibilities | Recruiting Chair and Host Duties and Responsibilities Duties of the Recruitment Chair Setup an initial schedule on the visitor page for the candidate when the dates are known.  Include flight arrival and departure and hotel information. Make sure the Dean or Associate Dean gets a slot to meet with the candidate. Get the chair to sign up for a slot. Get the candidate in contact with the department secretary (Ms. Kenyetta Neale in 2015) to setup paperwork and make travel arrangements Designate a host for the candidate. Duties of the Candidate Host Check with the department secretary (Ms. Kenyetta Neale in 2015) to see if the paperwork has been initiated. Settle on a place for each meal.  Put the location for each meal on the visitor page. As host you can pay for the candidate’s meal and your own for lunch. For dinner you can pay for other faculty as long as the cost is reasonable (e.g. about $60 is okay).  Save the receipt, give it to Alisabet Valdes, and you will get reimbursed later. Make sure enough faculty sign up to fill up all of the slots.  Send e-mail to faculty who have not signed up to ask them to do so. Make sure a few faculty attend each meal. Determine if there are any special equipment needs for the talk.  Work with the Systems Group and/or Department of Scientific Computing to make sure there are no problems. Make sure the candidate has transportation. Indicate on the schedule who will provide the transportation each day. From the airport to the hotel From the hotel to the Department From the Department to the hotel To and from dinner To the airport Make sure that when the candidate has an appointment in another building (dean’s office, etc.) that someone will take the candidate there and pick the candidate up. Send e-mail to the candidate before he/she comes to establish contact and ask if there is anything he/she needs (meet with a realtor, etc.). If the candidate wishes to meet with graduate students, then setup a meeting with 5-10 graduate students in the candidate’s area of research. Be sure to not only reserve a slot on the schedule, but to also reserve a meeting room (151 Love or 208 Love). Remind the students to attend the meeting. If there is an available slot, then have the candidate meet with the Systems Group Head to get a tour of the Department. Make sure the candidate meets briefly with the department secretary during their visit so they can get a copy of receipts (e.g. airline tickets) to facilitate the candidate getting reimbursed.", "meta": {"url": "www.cs.fsu.edu/department/resources/recruiting-chair-and-host-duties-and-responsibilities/"}}