{"content": "Department Staff | Department Staff Alisabet Valdes – Business Manager Major areas of responsibility: accountant for the E&G and Foundation funds within the department, faculty and staff appointments, Department security coordinator Email: valdes [ at cs dot fsu dot edu ], afvaldes [ at fsu dot edu ] Office: 253A Love Phone: 644-5450 Work Hours: 8:00AM-5:00PM Jaden Austin – Departmental Administrative Assistant Major areas of responsibility – Assist department chair, assist professors with promotion and tenure binders, input Assignments of Responsibilities in OMNI, make arrangements for special events, maintain office supply inventory, timesheet management, key disbursement, manage travel and other reimbursements. Email: jaustin [ at cs dot fsu dot edu ] Office: 253 Love Phone: 644-2644 Daniel Clawson – Graduate Coordinator Major areas of responsibility: Processing applications for graduate admission and financial aid, sending acceptance and rejection letters to graduate student applicants, tracking status of current graduate students, and general assistance to the chair Email: clawson [ at cs dot fsu dot edu ] Office: 203D Love Phone: 645-4975 Edwina Hall – Administrative Associate Major areas of responsibility: E&G “OPS” payroll certifications, OPS appointments, purchase orders through Spearmart Email: ehall [ at cs dot fsu dot edu ] Office: 253C Love Phone: 644-0672 Work Hours: 8:00AM – 5:00PM Amy Sanderson – Academic Advisor Major areas of responsibility: Undergraduate advising for freshmen/sophomore Computer Science majors, CS minor, non-major information. Email: aesanderson [at fsu dot edu] Office: 203B Love Phone: TBA How to Schedule an Appointment: Log in to my.fsu.edu and click the “CC” icon at top left. Click “Schedule Advising.” Choose your service and advisor. Appointments for Non-Majors: Log in to my.fsu.edu and click the “CC” icon at top left. Click “Schedule Advising.” Click “learn about another major,” then “Computer Science Advising.” Note: Summer 2021 academic advising is conducted virtually through Zoom. Current FSU students may make appointments via Campus Connect. Zoom link and meeting ID are listed in availability in CC. Lauren Higbee – Academic Program Specialist Major areas of responsibility: Undergraduate advising for junior/senior Computer Science majors, progress checks, graduation clearances, major certification, etc. Email: lhigbee [at fsu dot edu] Office: 203C Love Phone: 850-644-8700 How to Schedule an Appointment: Log in to my.fsu.edu and click the “CC” icon at top left. Click “Schedule Advising.” Choose your service and advisor. Appointments for Non-Majors: Log in to my.fsu.edu and click the “CC” icon at top left. Click “Schedule Advising.” Click “learn about another major,” then “Computer Science Advising.” Note: Summer 2021 academic advising is conducted virtually through Zoom. Current FSU students may make appointments via Campus Connect. Zoom link and meeting ID are listed in my availability in CC. Lori McFadden – Grants Compliance Analyst Major areas of responsibility: Accountant for the grant funds within the department, pre and post award, C& G payroll certifications Email: mcfadden [ at cs dot fsu dot edu ] Office: 253B Love Phone: 850-644-8598 Work Hours: 8:00AM – 5:00PM Barbara Twyman – Administrative Associate Major areas of responsibility: Course creation and scheduling, academic space scheduling, assisting undergraduate and graduate advisors, submitting course book orders and course evaluation forms, serves as back-up key manager Email: twyman [ at cs dot fsu dot edu ], btwyman [ at fsu dot edu ] Office: 203A Love Phone: 850-644-236 Bobby Roy – System Administrator Major areas of responsibility: Assist in the management of computing and network resources Email: roy [ at cs dot fsu dot edu ] Office: 208E MCH (Carothers) Phone: 644-0516 Work Hours: 7:30am – 4:30pm", "meta": {"url": "www.cs.fsu.edu/department/staff/"}}