{"content": "Dr. Xian Mallory Joins the CS Department | Dr. Xian Mallory Joins the CS Department Dr. Xian Mallory joined the Department of Computer Science at FSU in Fall 2020. She obtained her bachelor’s degree in Shanghai Jiao Tong University in 2004, majoring in Information Engineering. She then obtained two master’s degrees in Shanghai Jiao Tong University and the John’s Hopkins University in 2006 and 2008, majoring in Pattern Recognition and Intelligent Systems, and Electrical Engineering, respectively. Between 2010 and 2012, Dr. Mallory worked in two genomic sequencing companies, the McDonnell Genome Institute at St. Louis, Missouri, and the Institute for Genome Sciences at Baltimore, Maryland. The booming of genomic sequencing and what the genomic data can do for cancer patients drove Dr. Mallory to further pursue her Ph.D. to develop her own computational tools for this interdisciplinary area. In 2012, Dr. Mallory went to Rice University to pursue her Ph.D. in Computer Science, collaborating with professors in MD Anderson Cancer Center on developing novel machine learning tools and algorithms to more accurately detect mutations in human genomes. She graduated with the Ph.D. in 2018 and continued her research on single-cell DNA sequencing data analysis with Dr. Luay Nakhleh in the Computer Science Department at Rice University as a Postdoctoral Research Associate, co-mentored by Dr. Nicholas Navin at MD Anderson Cancer Center. She was one of the awardees of the Computational Cancer Biology Trainee Program between 2018 and 2020. Due to the working experience at McDonnell Genome Institute, as well as the opportunity to work with international consortia such as The Cancer Genome Atlas (TCGA), Human Genome Structural Variation Consortium (HGSVC), and the Genome In A Bottle (GIAB), Dr. Mallory published numerous top journals in genomics area, including but not limited to Nature, Nature Methods, Nature Communications, New England Journal of Medicine, Cell Stem Cell, Genome Research, etc. She also published first-author papers on top journals such as Genome Research, Genome Biology, PLoS Computational Biology, etc. In addition, Dr. Mallory publishes in top conferences such as RECOMB-CG. Dr. Mallory is interested in collaborating with biologists who have interesting human genomics data such as NGS, PacBio, Optical Maps, 10X, Nanopore, HiC, single-cell DNA/RNA sequencing, etc. She is also interested in collaborating with computer scientists on developing novel computational tools to more accurately solve biological problems using algorithms, statistics, and machine learning.", "meta": {"url": "www.cs.fsu.edu/dr-xian-mallory-joins-the-cs-department/"}}