{"content": "Faculty promotion | Faculty promotion Congratulations to Prof. Zhenghao Zhang for being promoted to the rank of full professor and to Prof. Sonia Haiduc and Prof. Jie Yang for being promoted to the rank of associate professor with tenure, all effective in Fall 2019. Zhenghao Zhang received his B.Eng. and M.S. degrees in electrical engineering from Zhejiang University, Hangzhou, China, in 1996 and 1999, respectively. He received his Ph.D. degree in electrical engineering from the State University of New York at Stony Brook in 2006. From 1999 to 2001, he worked in industry as an embedded system Software Engineer. From 2006 to 2007, he was a Postdoctoral Researcher in the Computer Science Department at Carnegie Mellon University. He joined the faculty in the Computer Science Department at Florida State University in Fall 2007. His research interest is mainly wireless networks. Dr. Sonia Haiduc obtained her PhD and M.Sc. from Wayne State University in 2013 and 2009, respectively. Her research interests are in software engineering, and in particular in software maintenance and evolution, program comprehension, and software documentation. She currently advises 6 PhD students and 3 M.Sc. students, and works with several undergraduate students. Her research has been published in top journals and conferences in the field of software engineering and she is the recipient of several NSF grants. Her students are the recipients of several international research awards, such as an ACM Distinguished Paper Award and a Gold and a Silver Medal in ACM Graduate Research Competitions. She is also actively involved in the organization and review process of several conferences and journals. Jie Yang received his Ph.D. degree in Computer Engineering from Stevens Institute of Technology in 2012. His research interests include mobile computing and cybersecurity, with an emphasis on mobile healthcare, smart-home and vehicular applications, user and device authentication, and wireless security. He has published one book and three book chapters and 90+ research papers in prestigious journals and conferences such as IEEE Transactions on Mobile Computing (TMC), IEEE/ACM Transactions on Networking (IEEE/ACM ToN), IEEE Transactions on Dependable and Secure Computing (IEEE TDSC), IEEE Transactions on Parallel and Distributed Systems (TPDS), and ACM MobiCom/CCS/MobiSys/SenSys/UbiComp. His research is supported by the National Science Foundation (NSF) and the Army Research Office (ARO). He is the recipient of the Best Paper Award from ACM MobiCom 2011, Best Paper Runner-up Award from IEEE CNS 2013, Best Paper Award from IEEE CNS 2014, and Stevens Francis T. Boesch Award from Stevens Institute of Technology. His research has received wide press coverage including MIT Technology Review, The Wall Street Journal, NPR, CNET News, and Yahoo News.", "meta": {"url": "www.cs.fsu.edu/faculty-promotion/"}}