{"content": "Graduate Financial Aid | Graduate Financial Aid Please make sure to check out the general scholarships website that also has information on scholarships and fellowships available for students at: the general financial page . Graduate students in the Department of Computer Science are generally supported by the following means: Teaching Assistantships : The department employs a large number of teaching assistants. Recipients are selected by a faculty committee from the general application pool. In addition to academic qualifications, the committee considers attributes that are likely to affect an individual’s ability to teach, including spoken English fluency. Prior teaching experience is valuable but is not a requirement. Research Assistantships: Faculty members within the department have a number of research grants and contracts that support graduate student assistants. The hiring decisions are made by the individual faculty members who are the principal investigators of the various contracts and grants. Interested students might look at the Department of Computer Science web page listing current research grants , and contact individual faculty members directly. Department Sponsored Federal Scholarships : Many domestic students are supported by the FSU CS Cybersecurity Scholarship for Services Program Fellowships : Some students are supported by Department or University Scholarships and Fellowships Other Jobs: Students also find jobs outside the department, on or off campus. How to Apply for Financial Aid To apply for a fellowship or assistantship, a student only needs to complete the Application for Admission . All Computer Science graduate applicants will be considered for an assistantship through the department, unless otherwise sponsored by a third party (e.g. Military, Government of Origin). For those international students required to take the TOEFL exam, a score of 620 (Paper Based) or 105 (Internet Based) or 250 (Computer Based) is necessary to be considered for an assistantship through the department. Tuition & Fee Waivers Students on fellowships or graduate assistantships generally receive a partial waiver of tuition (excluding fees), in addition to a generous stipend. Students who are US residents from states other than Florida should apply for Florida residency as soon as possible, in order to qualify for in-state tuition. Please follow the instructions to become a Florida resident.", "meta": {"url": "www.cs.fsu.edu/financial-aid/graduate-financial-aid/"}}