{"content": "Department News | NEWS & ANNOUNCEMENTS David Whalley Selected as IEEE Fellow Nov 23, 2016 David Whalley has been elevated to IEEE Fellow effective January 1, 2017 “for contributions to architectural and compilation techniques to meet embedded system constraints.” read more Professor Yu Receives a New Grant from Lawrence Livermore National Lab Oct 20, 2016 Yu Receives Grant for Burst Buffer Research read more Computer Science Department gets awarded its largest grant Oct 7, 2016 In September 2016 the Computer Science Department was awarded its largest grant in the history of the department. read more CS teams up with FSU-Teach and College of Education to investigate  methods to incorporate Computer Science education in middle school  mathematics courses. Sep 22, 2016 CS faculty Prof. Xin Yuan and Prof. David Whalley team up with Prof. Ellen Granger and Prof. Sherry Southerland from FSU-Teach and Prof. Christine Larson from College of Education in a project to investigate methods to incorporate Computer Science education in middle school mathematics courses. read more Professor Zhenghao Zhang awarded a grant for wireless networks research Aug 10, 2016 The National Science Foundation (NSF) recently awarded a 3-year, $360,751.00 grant to Prof. Zhenghao Zhang for his research in wireless networks. read more Professor Xin Yuan wins a grant for Software Defined Networking research Jul 7, 2016 Department of Energy (DoE) awards a 3-year $450,000 research grant to Prof. Xin Yuan for his research in Software Defined Networking (SDN). read more Computer Science Welcomes Two New Faculty Members May 24, 2016 Dr. Viet Tung Hoang and Dr. Adrian Nistor join the Computer Science department this fall semester as assistant professors. read more Professor Yu Receives a Research Grant from Oak Ridge National Lab Apr 25, 2016 Dr. Weikuan Yu from the Department of Computer Science at Florida State University is awarded a grant of $100K from Oak Ridge National Laboratory for his most recent project on big data analytics research. read more CS received $123K university technology fee to upgrade its computing infrastructure Apr 20, 2016 University Student Technology Fee Committee has awarded $122,618 to the Department of Computer Science for upgrading its computing infrastructure in April 2016. read more Professor Sonia Haiduc Wins NSF Grant Dec 7, 2015 Computer Science Assistant Professor Sonia Haiduc recently won an NSF grant in the amount of $225,000 for her current research in the software engineering field. read more « Older Entries Next Entries »", "meta": {"url": "www.cs.fsu.edu/news/department-news/page/7/"}}