{"content": "Student Achievements | STUDENT ACTIVITIES & ACHIEVEMENTS CS Student Presented in Top Security Conference Sep 06, 2016 CS Student Presented in Top Security Conference read more CS Student Published in Top Storage Systems Conference Aug 30, 2016 Fourth year PhD student, Shuanglong Zhang, published his recent work on USENIX FAST 2016, a top tier conference in the storage systems area. read more CS Student Selected to Be a 2016-17 PIE Teaching Associate May 06, 2016 Computer Science Ph.D. Student Gokila Dorai was selected to be a PIE (Program for Instructional Excellence) Teaching Associate for the term 2016-17. read more 2015-2016 UPE Inductees May 02, 2016 • Jordan T. Baker • Monica Lambrano • Christopher Cassion • Hannah McLaughlin • Nikhil Lloyd Cordeiro • Taylor Shields • Dan Diamond • Caleb Tidwell • Gokila Dorai • Sean Koji Tilley • Dominic Fezzie • William... read more Carl and Ermine Owenby Sr. Scholarship May 02, 2016 • Jennifer Yarboro • Woohyeong... read more Harris Scholarship May 02, 2016 Graduate Fellowship Recipient: • Rebecca James Undergraduate Scholarship Recipients: • Luis Penagos • Dillon Hall-Rodriguez • Ian... read more Phi Beta Kappa Inductees May 02, 2016 • Christian Patino • Michael Black • Sean Koji Tilley • Andrew Lindsay • Phalguna... read more S-STEM Scholars May 02, 2016 • Richard Allen • James Picker • Aaron Kemmer • Grace Bunch • Ashley Roberts • Matthew O’Hagan • Peter Connolly • Taylor Shields • Emilio Figueroa • Ariana Maria Davis • Remington Trettin • Nikolas Goetzke • Tatiana Joseph • Simon Baduy • Alexander Petrov • Nicholas Kelton • Timothy Barao • Jennifer Yarboro • Bayan Kharazmi • Jared Bennett • Zachary Pell • Miguel Mejia • Connor... read more Scholarship For Service 2015-2016 May 02, 2016 • Aranya Ajith • Nicholas Clark • Brandon Hillan • Rebecca Powell • Carl Bellefleur • Christian Vazquez • Thomas Clayton • Ricardo Castilla • Samir Yuja • Elliot Mudrick • Mitchell Schmidt • Douglas Hennenfent • Shawn Stone • Ian Michaels • Johann Thairu • Jacob Knoblauch • Connor McLaughlin • Scott Watson • Lindsey Barlett •Yaroslav... read more Student Publications 2016 May 02, 2016 • Michael Mitchell, An-I Andy Wang, and Peter Reiher. Cashtags: Protecting the Input and Display of Sensitive Data. • Peixiang Zhao, Charu Aggarwal, Gewen He. Link Prediction in Graph Streams. • Charu Aggarwal, Gewen He, Peixiang Zhao. Edge Classification in Networks. • Sangmun Kim, Zhenhai Duan, Fernando Sanchez. Scalable Name-Based Inter-Domain Routing for Information-Centric Networks. • B. Davis, P. Gavin, R. Baird, M. Sjalander, I. Finlayson, F. Rasapour, G. Cook, G. Uh, D. Whalley, G. Tyson. Scheduling Instruction Effects for a Statically Pipelined Processor. • Escobar-Avila, J., Linares-Vasquez, M., Haiduc, S. Unsupervised Software Categorization using Bytecode. • Escobar-Avila, J. Automatic Categorization of Software Libraries Using Bytecode. •Taylor Brockhoeft, Jennifer Petuch, James Bach, Emil Djerekarov, Margareta Ackerman and Gary Tyson. Interactive Augmented Reality for Dance. • D. Moreau, A. Bardizbanyan, M. Sjalander, D. Whalley, P. Larsson-Edefors. Practical Way Halting by Speculatively Accessing Halt Tags. • Y. Chen, Z. Wang, D. Whalley, L. Lu. Remix: On-demand Live Randomization. • T. Wang, K. Vasko, Z. Liu, H. Chen, W. Yu. Enhance Scientific Application I/O with Cross-Bundle Aggregation. • H. Fu, Y. Zhu, W. Yu. A Case Study of MapReduce Speculation for Failure Recovery. • Lizhen Shi, Zhong Wang, W. Yu, Xiandong Meng. Performance Evaluation and Tuning of BioPig for Genomic Analysis. • M. Liu, A. Mukherjee, Z. Zhang and X. Liu, TBAS: Enhancing Wi-Fi authentication by actively eliciting channel state information. • A. Mukherjee and Z. Zhang. Channel state information compression for MIMO systems based on curve fitting. • Z. Zhang and A. Mukherjee. Friendly channel-oblivious jamming with error amplification for wireless networks. • T. Wang, H.S. Oral, H. Pritchard, B. Wang... read more « Older Entries Next Entries »", "meta": {"url": "www.cs.fsu.edu/news/student-highlights/page/3/"}}