{"content": "Department News | NEWS & ANNOUNCEMENTS Professor Yuan received an NSF grant for his research on Software Defined Networking in High Performance Computing systems Oct 2, 2020 Dr. Xin Yuan has been awarded a grant of $500K from the National Science Foundation titled “Understanding and Exploiting SDN in HPC environments.” read more Professors Wang, Whalley, Haiduc, and Liu Awarded a $1 Million Grant from the National Science Foundation Aug 25, 2020 Professors Wang, Whalley, Haiduc, and Liu Awarded a $1 Million Grant from the National Science Foundation. read more Dr. Gubanov published a paper in the August issue of Communications of ACM Aug 19, 2020 Michael Gubanov has published a paper in Communications of ACM, together with collaborators from Rice University. The journal is known to be very selective, summarizing the most impactful contributions to Computer Science across all areas. Gubanov describes a novel data analytics system, marrying linear and relational algebra, introduced by Edgar Codd in Communications of ACM in 1970 and used widely in data management systems today. read more Dr. Shayok Chakraborty receives the AWS Machine Learning Research Award Apr 28, 2020 FSU Computer Science Assistant Professor, Dr. Shayok Chakraborty, has received the prestigious AWS Machine Learning Research Award for his project “Active Learning with Imperfect Oracles”. read more Dr. Weikuan Yu Receives Grants for Collaborative Research on Deep Learning Apr 10, 2020 Dr. Weikuan Yu has been awarded a grant of $300K from the National Science Foundation titled “IRES Track-1: I/O Research for Data-Intensive Analytics and Deep Learning”. Dr. Weikuan Yu also received two grants in the amounts of $72K and $74K from Lawrence Livermore National Laboratory. read more Dr. Shayok Chakraborty receives the Amazon Research Award Mar 30, 2020 FSU Computer Science Assistant Professor, Dr. Shayok Chakraborty, has received the Amazon Research Award for his project “Deep Active Learning with Relative Label Feedback”. read more Dr. Sudhir Aggarwal receives NIJ award for AI Enabled Community Supervision for Criminal Justice Services Jan 31, 2020 Dr. Sudhir Aggarwal (Department of Computer Science) and Dr. Carrie Pettus-Davis (Department of Social Work) are co-PIs on a recently funded NIJ award for $1,999,778, entitled “AI Enabled Community Supervision for Criminal Justice Services.” read more Dr. Jie Yang awarded $459K NSF grant for Wireless Sensing Research Jan 22, 2020 Professor Jie Yang awarded $459k NSF grant for WiFi-based Ubiquitous Sensing read more Dr. Xifeng Gao awarded an NSF grant for Curved Mesh Generation and Analysis Sep 30, 2019 FSU Computer Science Prof. Xifeng Gao recently received a grant from the National Science Foundation (NSF) for his project “Robust High Order Meshing and Analysis for Design Pipeline Automation”. read more Dr. David Whalley awarded $600K NSF grant for Instruction-Level Parallelism Research Sep 25, 2019 FSU Department of Computer Science Professor David Whalley has been awarded a new NSF grant for his project “Statically Controlled Asynchronous Lane Execution (SCALE)”. read more « Older Entries Next Entries »", "meta": {"url": "www.cs.fsu.edu/news/department-news/page/2/"}}