{"content": "PhD | PhD Graduates Name Major Prof Dissertation Title Employment Fall 2016 Tathagata Mukherjee Dr. Piyush Kumar Chief Scientist, Intelligent Robotics Inc. (An USAF Contractor)Working on US Air Force Contracts Martin Kenneth Brown Dr. Gary S. Tyson title: Software EngineerEmployer: LHP Engineering SolutionsAddress: 1888 Poshard Dr., Columbus, IN 47203(812) 373-0880 Summer 2016 Christopher Ogden Michael Mascagni Spring 2016 Jaewon Yang Xiuwen Liu Continue to serve as a military officer (Current Rank: Major),Republic of Korea Army Fall 2015 Justin B Marshall Dr Gary Tyson System Librarian/Assistant ProfessorBYU – Hawaii Campus55-220 Kulanui StLaie Hi 96762808-675-4719 Summer 2015 Jonathan Jenkins Prof. Mike Burmester Expected: Teaching Postdoc, Florida State University Dept. of Computer Science,253 Love Building,Florida State University,Tallahassee, FL 32306 Shiva Houshmand Dr. Sudhir Aggarwal Assistant Professor, Southern Illinois University Carbondale, Department of Computer Science, Carbondale, IL Umit Karabiyik Sudhir Aggarwal Assistant Professor, Sam Houston State University Spring 2015 Nan Zhao Xiuwen Liu Frank Sposaro Gary Tyson Microsoft. SWD Jeremy Hatcher Daniel Schwartz EngineerLittoral Warfare Research Facility110 Vernon AvenuePanama City, Florida 32407850-234-4179 Michael Mitchell Andy Wang Fall 2014 Yu Zhang Dr. Xiuwen Liu Summer 2014 Jiangbo Yuan Dr. Xiuwen Liu Scientist, Canon USA. Spring 2014 Guanyu Tian Dr. Zhenhai Duan Assistant Professor, Fontbonne University. Fall 2013 Yue Qiu Michael Mascagni Wickus Nienaber Xin Yuan Chi Zhang Dr. Xin Yuandr. Feifei Li Summer 2013 Santosh Mahapatra Xin Yuan Member of Technical Staff, Riverbed Technology Inc, 199 Fremont Street, San Francisco, CA 94105 Zheng Gu Xin Yuan Postdoc oak ridge national lab Spring 2013 Fall 2012 Matthew Small Xin Yuan Samidh Chatterjee Piyush Kumar Position title : Sr. Research ScientistEmployer : Airsage Inc., Atlanta, GA Sarah Diesburg An-i Andy Wang Postdoc, Computer Science Department, FSU Wei Hu Zhenghao Zhang Summer 2012 Jin Xie Dr. Zhenghao Zhang Justin Fincher Gary Tyson And Jonathan Dennis Postdoctoral Fellow – Florida State University – Department of Biological Science Ian Finlayson David Whalley And Gary Tyson Visiting Instructor, University of Mary Washington. Yue Li Gary Tyson Fall 2011 Fernando Sanchez Dr. Zhenhai Duan Summer 2011 Bin Yao Feifei Li assistant professor; Shanghai Jiao Tong University; 800 Dong Chuan Road, Shanghai, 200240, P.R.China Arturo Donate Dr. Xiuwen Liu Haohai Yu Robert Van Engelen SDEMicrosoft Redmond WA Wayne W. Liu Dr. Sudhir Aggarwal Spring 2011 Michael Connor Piyush Kumar Department of DefenseMaryland Fall 2010 Summer 2010 Paul Edwin West Gary Tyson Software Engineer working for SPAWAR(Navy) Yanan Yu Ashok Srinivasan Spring 2010 Huey Ling Toh Dr. Lois Wright Hawkes Yuhua Zhu Dr. Xiuwen Liu Charles Matt Weir Dr. Sudhir Aggarwal I have a job offer with Northrop Grumman as a Network Security Engineer. Don’t know if I will take it, or which office I will be working out of. Fall 2009 Yiming Wu", "meta": {"url": "www.cs.fsu.edu/phd/"}}