{"content": "Recent Student Publications in CS | Recent Student Publications in CS Just some of the recent student publications produced by members of the FSU Computer Science program. T. Taami, A.M. Rahmani, A. Khademzadeh, A. Ataie, Overclocked Load Scheduling in Large Clustered Reservation Systems, IJCSIS, Vol. 8, No.4, USA, 2010. Bhattacharya S., Salman S., Gorentla Venkata M., Kundnani H., Imam N., Yu W. (2019) An Initial Implementation of Libfabric Conduit for OpenSHMEM-X. In: Pophale S., Imam N., Aderholdt F., Gorentla Venkata M. (eds) OpenSHMEM and Related Technologies. OpenSHMEM in the Era of Extreme Heterogeneity. OpenSHMEM 2018. Lecture Notes in Computer Science, vol 11283. Springer, Cham F.  Chowdhury,  J.  Liu,  Q.  Koziol,  T.  Kurth,  S.  Farrell,  S.  Byna,  Prabhat,  and  W.  Yu,  ”Initial Characterization of I/O in Large-Scale Deep Learning Applications,” in SC’18, 3RD Joint International Workshop  on  Parallel  Data  Storage  &  Data  Intensive  Scalable  Computing  Systems  (PDSW-DISCS 2018), 2018. “I Know What You Did Last Summer: Your Smart Home Internet of Things and Your iPhone Forensically Ratting You Out”, Gokila Dorai (Florida State University, United States), Shiva Houshmand (Santa Clara University, United States) and Ibrahim Baggili (University of New Haven, United States) In Proceedings of the 13th International Conference on Availability, Reliability and Security (ARES) 2018, Hamburg, Germany “Design and Implementation of a Targeted Data Extraction System for Mobile Devices”, Sudhir Aggarwal, Gokila Dorai, Umit Karabiyik, Tathagata Mukherjee, Nicholas Guerra, Manuel Hernandez, James Parsons, Khushboo Rathi, Hongmei Chi, Temilola Aderibigbe and Rodney Wilson Fifteenth IFIP WG 11.9 International Conference on Digital Forensics, Orlando, USA “Integrating Travel and Epidemic Models for Vector Borne Disease Surveillance”, Meysam Ghaffari, Judy Wang, Anuj Chari, Ashok Srinivasan, Krishnan Viswanathan, Anuj Mubayi, Hongmei Chi, ITM 2018. Workload-aware Subgraph Query Caching and Processing in Large Graphs; Yongjiang Liang, Peixiang Zhao; ICDE’19: The 35th IEEE International Conference on Data Engineering. Macau SAR, China. Apr. 2019 Similarity Search in Graph Databases: A Multi-layered Indexing Approach; Yongjiang Liang, Peixiang Zhao; ICDE’17: The 33rd IEEE International Conference on Data Engineering. San Diego, California. Apr. 2017 Viet Tung Hoang, David Miller, and Ni Trieu. Attacks Only Get Better: How to Break FF3 on Large Domains, to appear in EUROCRYPT 2019 C. Mills, J. Pantiuchina, E. Parra, G. Bavota, and S. Haiduc, “Are Bug Reports Enough for Text Retrieval-based Bug Localization?,” in Proceedings of the 34th IEEE International Conference on Software Maintenance and Evolution (ICSME’18), Technical Research Track, Madrid, Spain, 2018, p. to appear (12 pages). IEEE TCSE Distinguished Paper Award E. Parra, J. Escobar-Avila, and S. Haiduc, “Automatic Tagging for Software Engineering Videos,” in Proceedings of the 26th ACM/IEEE International Conference on Program Comprehension (ICPC’18), Technical Research Track, Gothenburg, Sweden, 2018, p. to appear (12 pages). M. Podkorytov, M. Gubanov. Hybrid.Poly: A Consolidated Interactive Analytical Polystore System, in ICDE’19. (2) M. Podkorytov, M. Gubanov. Hybrid.Poly: Performance Evaluation of Linear Algebra Analytical Extensions, in Big Data’18. S. Soderman, A. Kola, M. Podkorytov, M. Geyer, M. Gubanov. Hybrid.AI: A Learning Search Engine for Large-scale Structured Data, in The Web Conference Companion ‘18. S. Ortiz, C. Enbatan, D. Soderman, M. Podkorytov, M. Gubanov. Hybrid.JSON: High-velocity parallel in-memory polystore JSON ingest, in Big Data’17. M. Podkorytov, D. Soderman, M. Gubanov. Hybrid.poly: An Interactive Large-Scale In-memory Analytical Polystore, in ICDMW DSDBA’17. E. Parra, J. Escobar-Avila, and S. Haiduc, “Automatic Tagging for Software Engineering Videos,” in Proceedings of the 26th ACM/IEEE International Conference on Program Comprehension (ICPC’18), Technical Research Track, Gothenburg, Sweden, 2018, p. to appear (12 pages). M. Podkorytov, M. Gubanov. Hybrid.Poly: A Consolidated Interactive Analytical Polystore System, in ICDE’19. (2) M. Podkorytov, M. Gubanov. Hybrid.Poly: Performance Evaluation of Linear Algebra Analytical Extensions, in Big Data’18. S. Soderman, A. Kola, M. Podkorytov, M. Geyer, M. Gubanov. Hybrid.AI: A Learning Search Engine for Large-scale Structured Data, in The Web Conference Companion ‘18. S. Ortiz, C. Enbatan, D. Soderman, M. Podkorytov, M. Gubanov. Hybrid.JSON: High-velocity parallel in-memory polystore JSON ingest, in Big Data’17. M. Podkorytov, D. Soderman, M. Gubanov. Hybrid.poly: An Interactive Large-Scale In-memory Analytical Polystore, in ICDMW DSDBA’17.", "meta": {"url": "www.cs.fsu.edu/recent-student-publications-in-cs/"}}