{"content": "Graduate Faculty Research Areas | Graduate Faculty Research Areas Sudir Aggarwal : Computer Networks, Cybersecurity, Distributed and Real-time Systems, Search Engines, Modeling and Simulation Mike Burmester : Security, Cryptography, Privacy/Anonymity, Pervasive/Ubiquitous Systems, Lightweight Cryptographic Applications, RFIDs and Sensor Applications, Trust Management Shayok Chakraborty : Computer Vision and Machine Learning Zhenhai Duan : Computer Networks, Multimedia Applications, Routing, Network Security, Wireless Networks Grigory Fedyukovich : Automated software verification and synthesis, Equivalence checking, and Applications of relational verification to analyzing software security. David Gaitros : Software Engineering Xifeng Gao : Computer Graphics, Computer Vision, Visualization, Robotics, and Fabrication. Michael Gubanov : Data Science, Large-scale Data Management, Scalable Machine/Deep Learning, Web-search, and Mobile Computing. Sonia Haiduc : Software Engineering, Software Maintenance and Evolution, Program Comprehension, Source Code Search Lois Hawkes : Computer Networks, High Performance Computing, Fault-tolerance Viet Tung Hoang : Cryptography and Algorithms Alan Kuhnle : Optimization, Machine Learning, and Network Science Piyush Kumar : Algorithms with applications to Computational Geometry, Computer Graphics, Pattern Recognition, and Machine Learning Xiuwen Liu : Computer Vision, Pattern Recognition Xian F. Mallory : Bioinformatics and Cancer Genomics Michael Mascagni : Stochastic Computing, Monte Carlo Methods and their Applications Chris Mills : Software Engineering, Artificial Intelligence, and Large Scale Data Analytics. Daniel Schwartz : Mathematical Logic, Fuzzy Logic, Formal Methods in Artificial Intelligence Gary Tyson : Computer Architecture, Compiler Optimizations, Mobile Computing, Bioinformatics An-I Andy Wang : File Systems, Operating Systems Zhi Wang : Operating System Security, Virtualization Security, Mobile Security David Whalley : Compilers, Computer Architecture, Embedded Systems, Performance Evaluation Jie Yang : Cybersecurity, Mobile Computing Weikuan Yu : Structured and Unstructured Database Systems, Data Mining, Big Data Analytics, Social Network, Parallel Computer Systems and Architecture, High Speed Interconnects, Cloud Computing, Computational Biology and Climate Modeling, Storage Systems, Networking, Scientific Computing Xin Yuan : Computer Networks, Software Defined Networks, Interconnection Networks, Parallel Computer Architecture and Systems, High Performance Computing Jiawei Zhang : Data Fusion, Data Mining, and Machine Learning Zhenghao Zhang : Computer Networks, Network Security Systems, Scheduling, Performance Analysis, Wireless Access Networks, Cross-layer Design, Optical Networks, Wireless Sensor Networks Peixiang Zhao : Database Systems, Data Mining, Data-intensive Computation and Analytics", "meta": {"url": "www.cs.fsu.edu/research/graduate-faculty-research-areas/"}}