{"content": "Student Publications 2016 | Student Publications 2016 May 2, 2016 | Student Recognition • Michael Mitchell, An-I Andy Wang, and Peter Reiher. Cashtags: Protecting the Input and Display of Sensitive Data. • Peixiang Zhao, Charu Aggarwal, Gewen He. Link Prediction in Graph Streams. • Charu Aggarwal, Gewen He, Peixiang Zhao. Edge Classification in Networks. • Sangmun Kim, Zhenhai Duan, Fernando Sanchez. Scalable Name-Based Inter-Domain Routing for Information-Centric Networks. • B. Davis, P. Gavin, R. Baird, M. Sjalander, I. Finlayson, F. Rasapour, G. Cook, G. Uh, D. Whalley, G. Tyson. Scheduling Instruction Effects for a Statically Pipelined Processor. • Escobar-Avila, J., Linares-Vasquez, M., Haiduc, S. Unsupervised Software Categorization using Bytecode. • Escobar-Avila, J. Automatic Categorization of Software Libraries Using Bytecode. •Taylor Brockhoeft, Jennifer Petuch, James Bach, Emil Djerekarov, Margareta Ackerman and Gary Tyson. Interactive Augmented Reality for Dance. • D. Moreau, A. Bardizbanyan, M. Sjalander, D. Whalley, P. Larsson-Edefors. Practical Way Halting by Speculatively Accessing Halt Tags. • Y. Chen, Z. Wang, D. Whalley, L. Lu. Remix: On-demand Live Randomization. • T. Wang, K. Vasko, Z. Liu, H. Chen, W. Yu. Enhance Scientific Application I/O with Cross-Bundle Aggregation. • H. Fu, Y. Zhu, W. Yu. A Case Study of MapReduce Speculation for Failure Recovery. • Lizhen Shi, Zhong Wang, W. Yu, Xiandong Meng. Performance Evaluation and Tuning of BioPig for Genomic Analysis. • M. Liu, A. Mukherjee, Z. Zhang and X. Liu, TBAS: Enhancing Wi-Fi authentication by actively eliciting channel state information. • A. Mukherjee and Z. Zhang. Channel state information compression for MIMO systems based on curve fitting. • Z. Zhang and A. Mukherjee. Friendly channel-oblivious jamming with error amplification for wireless networks. • T. Wang, H.S. Oral, H. Pritchard, B. Wang and W. Yu. TRIO: Burst Buffer Based I/O Orchestration. • B. Wang, W. Yu, X.H. Sun, X. Wang. DaCache: Memory Divergence-Aware GPU Cache Management. • Fang Zhou, Hai Pham, Jianhui Yue, Hao Zou and Weikuan Yu. SFMapReduce: An Optimized MapReduce Framework for Small Files. • Y. Wang, H. Fu, and W. Yu. Cracking Down MapReduce Failure Amplification through Analytics Logging and Migration. • B. Wang, Z. Liu, X. Wang, and W. Yu. Eliminating Intra-Warp Conflict Misses in GPU. • Shiva Krishna Imminni, Mir Anamul Hasan, Michael Duckett, Puneet Sachdeva, Sudipta Karmakar, Piyush Kumar, and Sonia Haiduc. SPYSE – A Semantic Search Engine for Python Packages and Modules. • Piyush Kumar, Tathagata Mukherjee, Eduardo Pasiliao, Liqin Xu. Cheap approximate localization using FM radio. • X. Wang, B. Wang, Z. Liu, W. Yu. Preserving Row Buffer Locality for PCM Wear-Leveling Under Massive Parallelism. • C. Xu, R. Goldstone, Z. Liu, H. Chen, B. Neitzel, W. Yu. Exploiting Analytics Shipping with Virtualized MapReduce on HPC Backend Storage Servers. • W. Yu, Y. Wang, X. Que, C. Xu. Virtual Shuffling for Efficient Data Movement in MapReduce. • Xiaoguang Wang, Yue Chen, Zhi Wang, Yong Qi, Yajin Zhou. SecPod: A Framework for Virtualization-based Security Systems. • Redwood, O., Lawrence, J. and Burmester, M. A Symbolic Honeynet Framework for SCADA Threat Intelligence. • Jenkins, J. and Burmester, M. Run-Time Integrity for Cyber-Physical Infrastructures. • Owen Redwood, Jason Reynolds, and Mike Burmester. A Simulated and Physics and Embedded Virtualization Integration (SPAEVI) Methodology. •Ponzanelli, L., Bavota, G., Mocci, A., Di Penta, M., Oliveto, R., Hasan, M., Russo, B., Haiduc, S., Lanza, M. Too Long; Didn’t Watch! Extracting Relevant Fragments from Software Development Video Tutorials. • M. Burmester, X. Liu, J. Lawrence, M. Yu, M. Steurer, M. Sloderbeck and M. Stanovich. Developing a Resilience Testbed for Vulnerability Analysis and HIL testing of Electrical Grids. • Aranya Ajith and Rebecca Powell. Software Protection against Reverse Engineering Threats. • Rebecca Powell and Aranya Ajith. The Secret Life of a Code: How Reverse Engineering Exposes its Hidden Agenda. • A. Mollah, X. Yuan, S. Pakin, and M. Lang. Fast Calculation of Max-min Fair Rates for Multi-commodity Flows in Fat-Tree Networks. • Tong Zhou, Scott Pakin, Michael Lang, and Xin Yuan. Fast Classification of MPI Applications Using Lamport’s Logical Clocks. • S. Houshmand, S. Aggarwal, R. Flood. Next Gen PCFG Password Cracking. • Shiva Houshmand, Sudhir Aggarwal, Umit Karabiyik. Identifying Passwords Stored on Disk. • Parra, E., Haiduc, S., James, R. Making a Difference: An Overview of Humanitarian Free Open Source Systems.", "meta": {"url": "www.cs.fsu.edu/student-publications-2016/"}}