{"content": "Sudhir Aggarwal elected Mainline Information Systems Endowed Professor | Sudhir Aggarwal elected Mainline Information Systems Endowed Professor Former Department Chair Dr.  Sudhir Aggarwal was elected this year as the Mainline Information Systems endowed professor. This nomination carries with it a monetary award of $6,000 to be allocated toward future research uses. Dr.  Aggarwal has shown his passion for our department for over a decade. Before joining the department as chair in 2002, he was Chief Technology Officer of the Internet Content Delivery and Distribution business unit of Lucent Technologies and also Director of the Network Computing Research Department at Bell Laboratories. His current research interests are in password cracking and digital forensics. His previous research spans topics in computer and communication networks, cyber security software, infrastructure for network multiplayer games and verification of communication protocols, among other aspects. He earned a Ph.D. from the University of Michigan in Computer and Communication Sciences, and M.S. and B.S degrees in Mathematics from the University of Michigan and Stanford University respectively. Dr.  Aggarwal is the only professor to hold the position recently since this award has remained vacant for several years. Mainline Information Systems is a Tallahassee based corporation that designs and supports IT solutions that help businesses increase their effectiveness. The endowed professorship is a partnership with Mainline that goes back to the 2008-2009 academic year. The goal of this award is to support the department and the individuals who strive to make it the best it can be. Each professorship carries a three year term. All nominees must be tenured faculty to be eligible and must not currently hold any other named professorships. Congratulations Dr.  Aggarwal for your award and good wishes on your future research endeavors here at Florida State University.", "meta": {"url": "www.cs.fsu.edu/sudhir-aggarwal-elected-mainline-information-systems-endowed-professor/"}}